{
   "d810a":{
      "url":"http://www.amazon.in/Nikon-D810-36-3MP-Digital-Camera/dp/B00LAJQVR6",
      "reviews":{
         "reviews":[
            {
               "body":"it is a great Camera, all reviews of the product will tell you that. However i had a very bad experience with Amazon india. It is fairly expensive thing to buy online...the delivery was late, i had to call 15 times and the support had no clue to where the shipment was..they just read the track information back to you.Moreover it is about 550$ more expensive online than waht you can buy in shop for..thats a cool 35,000 Rs less. with all warranties etc. Great Camera..but buy it at a better place.",
               "rating":5.0,
               "usefulness":0.7142857142857143,
               "title":"Great Camera, Bad delivery, and Expensive at Amazon, 14 August 2014"
            }
         ],
         "avg_rating":5.0
      },
      "specs":{
         "Item model number":"1542",
         "Batteries:":"1 Lithium ion batteries required. (included)",
         "Max Vertical Resolution":"4912 Pixels",
         "Date First Available":"21 July 2014",
         "Has Self Timer":"Yes",
         "Has Image Stabilization":"No",
         "Optical Zoom":"1 X",
         "img":"http://ecx.images-amazon.com/images/I/51keaCQQLfL._SX300_.jpg",
         "Brand":"Nikon",
         "Max Resolution":"36.3",
         "Hardware Interface":"AV",
         "Screen Size":"3.2 Inches",
         "Viewfinder Type":"Optical (tunnel)",
         "Batteries Included":"Yes",
         "Batteries Required":"Yes",
         "price":180600.0,
         "Optical Sensor Resolution":"36.3 Megapixels",
         "Item Weight":"980 g",
         "Continuous Shooting Speed":"5",
         "Has Auto Focus":"Yes",
         "Model":"1542",
         "Resolution":"36.3 megapixels",
         "Min Focal Length":"28 Millimeters",
         "Has Audio Recording":"Yes",
         "Max Shutter Speed":"1/8000 Seconds",
         "Min Shutter Speed":"30 seconds",
         "ASIN":"B00LAJQVR6",
         "Digital Zoom":"46 X",
         "Model Year":"2014",
         "Product Dimensions":"14.6 x 8.2 x 12.3 cm"
      }
   },
   "d3200":{
      "url":"http://www.amazon.in/Nikon-D3200-Digital-Camera-18-55mm/dp/B00JXEL4YA",
      "reviews":{
         "reviews":[
            {
               "body":"The 1 star is for the product description.I made the purchase on 8th of june and when the return period expired the camera charger stopped working.The information on amazon says 2 years of warranty, but the service card and Nikon say no coverage for any accesory.Apart from this here is a mail from Nikon Service\"Dear Mr. Agarwal,Thank you very much for writing to us.In reference to your query, we like to inform you that accessory such as charger are not covered under warranty and the same is mentioned on warranty card as well.Moreover, Nikon India do not deal in online sales and Amazon is not an authorized dealer of Nikon India.Thanks & Regards,NIND SUPPORT\"Say it as my bad luck or what, but now i would have to shell out 2.5k more for the charger.Thanks a lot Amazon for this.",
               "rating":1.0,
               "usefulness":0.9359605911330049,
               "title":"Unreliable Information., 26 June 2014"
            },
            {
               "body":"I gave a lot of thought while choosing a beginner DSLR and shortlisted two-one from each of the biggies. Canon 600D and Nikon D3200. Each has its own advantages and finally I came up with a few things that I felt are really significant. Here they are!1. Nikon's C-MOS is around 10% bigger than Canon's, It's just enough to understand that sensor is equivalent to film in the yester year cameras and the bigger the sensor, the more the detail and better the image.2. Nikon has got more Megapixels. Don't get me wrong, One of the best and costliest cameras Nikon D4 has got a sensor resolution of (only?) 16.2 MP and I don't dare say that D3200 is a match for it. I'm just saying that bigger sensor and better resolution in D3200 compared to 600D (esp when we do a lot of cropping) inclined me towards it.3. D3200 has more auto-focus points (11 vs 9) that aid in better tracking in AF-Area dynamic mode, has slightly better frame rate (4 vs 3.7), much lesser start up time, better weighs lighter.4. Auto-focus during video recording.5. Most importantly Nikon has a much cheaper price tag.1. Canon 600D has articulating LCD screen means that the screen isn't fixed-very useful when using Live mode when subjects is at low/ ground level. Nikon has a fixed one.2. Canon has found to deliver better performance at really high ISOs (less noise) as per one website which I religiously follow but nevertheless I rarely use really higher ISOs so as to pick on the noise.3. Canon has in-built auto focus motor but many of the recent Nikkor lenses come with foucs motor, so I didn't feel it's such a big issue.4. 600D has a better LCD screen, it better resembles the final image and also a bigger viewfinder.I weighed my choices and finally went ahead with Nikon and it never disappointed me.Finally I was really awed by Amazon's packing!",
               "rating":5.0,
               "usefulness":0.9152542372881356,
               "title":"Excellent DSLR for beginners!, 9 May 2014"
            },
            {
               "body":"I bought this camera for 33k in June 2012, since then, 30 months has passed, and the price has dropped to 23k.--------------------------------------------Comparing this to the Canon 600D:--------------------------------------------The 600D has a flippy screen. But mind you, you can easily damage the flippy screen. Happened to me in all flippy screen cameras including the D5200.It has a 10% smaller sensor, effectively making it a 1.6x crop factor sensor, as opposed to all other brands' APS-C cameras who have a 1.5x crop factor sensors. I don't know why they still carry forward this tradition, it handicaps every APS-C sensor by making them smaller compared to others. It has only 18MP, so pixel pitch is around 4.3m, where as the D3200 has a pixel pitch of 3.85m. In spite of this, the overall high ISO quality is better than the Canon, maybe because the Nikon sensor is a newer 2012 model[2.5 years old at time of writing], whereas the Canon sensor in over 6 years old.Both have decent 1080p video. The D3200 is a tad bit faster though, cranking out 4fps as opposed to 3.7.Its currently retailing at ~32k in Amazon, but I'm sure you can get it for a lesser rate at your local dealer, but its still not going to be anywhere near what you can get the D3200 for. Should be able to get it for 20-22k if you try hard enough.The button configuration of the 600D is similar to the D5200, but the menus layout is different from the Nikon.Battery life is a bit better on the Nikon, I've been able to squeeze out ~4000 shots out of two batteries which I carried with me.But you got to disable image review, and auto info display when you half press the shutter button.------------------------------------Comparison with the D5200:------------------------------------The D5200 is a bit better than the D3200 in focusing. But both cameras are still unreliable. All 39 points are no use when it comes to taking portraits, where the camera will focus on whatever is nearest. Its center focus point is similar to the D3200 in focusing. I cannot imagine tracking subjects with either cameras, so I only use them on AF-S mode.But one difference which I saw was the ability to increase the ISO in 1/3rd stops. In the D3200 we can only increase it in single stops, ie 100>200>400>800 and so on as opposed to 100>130>160>200> and so on. I think its faster this way, because there's only one dial for changing ISO and shutter speed on the D3200/D5200.D3200 shoots in 12 bit RAW, whereas D5200 shoots in 14 bit RAW. 20-25MB vs 25-30MB file size difference. High ISO is about 1/3rd of a shot cleaner in the D3200 as well.But is it worth 10k more than the D3200? The answer is no, I would pick the D3200 over the D5200, and get myself the 35mm or 50mm 1.8G for the price difference. Because there is no compelling advantage the D5200 offers over the D3200. On the contrary I consider the D3200 to be better built because of the absence of the flippy screen, since the D5200 screwed up on me several times. It could be good for video though.-------------------------------------------About my impression of the D3200:Overall, the D3200 is a very reliable piece of equipment for what its worth. Shot ~100k frames with it, and you can rely on it because its behavior is more or less fixed. Doesn't act on its own unlike other cameras like the flippy screened D5200 and the 600D. Does exactly what you intend without much fuss. If you have a bigger budget, consider the D7000 over the D5200/5300/5500, as its a much better camera.-------------------------------------------Nikon Service Review: I hate Nikon Service Centers. They're frustratingly slow unless you're NPS, and charge you ridiculous amounts for even opening and servicing anything even though there might not be any damage. I hope I'll upgrade my status to NPS in the future, until then, its a long and rough road ahead for me dealing with Nikon Service.Trivia: This camera doesn't have any lens calibration system, so AF irregularities with fast primes must be sorted by service centers within the first 2 years of purchase. I forgot this, since it isn't the only body I use, and my warranty has run out. I had to shell out ~3k for both body, and lens calibration.It also doesn't have weather sealing, like the D5200 and 600D, so you can expect condensation inside the viewfinder and on the lens elements when you move from an chilled room, to the outside where the humidity and temperature may differ.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Excellent camera for the price. Some info and stats after 30 months of usage., 25 January 2015"
            },
            {
               "body":"I would like to say something to all online buyers. I have taken 1 month to enquire about DSLR cameras and there was Rs.3000 price difference between online and outside dealer(Online cheap). When I enquire at outside dealers about Nikon D3200 DSLR camera, they said many false information about online product. They said that, online product wont be eligible for Nikon warranty and they will remove the original battery and assesories, etc. I did 1st thing after I receive Nikon D3200 from Amazon that, Have called Nikon customer care and provided the serial number of my Camera. Thay said that its genuine product and its eligible for 2 years India warranty. I have received the camera box as sealed pack and all the assesories are original. But I disappointed with the Camera Bag which could be some more quality.",
               "rating":5.0,
               "usefulness":0.8958333333333334,
               "title":"Read the review  to know about warranty, 14 August 2014"
            },
            {
               "body":"This is my first review ever. So please bear with me!!!Ordered on the 6th of June and got it on the 10th.Here's the timelineAmazon carefully packed it with airbags to prevent it from coming to any harm as the lenses and the camera very prone to damages in transit. FedEx did an exceptional job delivering the package.Opening the outer box you would be drawn to the camera box and the beautiful leather bag in it.It took me a while to find the 8gb memory card which was taped on to the side of the camera box. So you need eagle eyes!!!The box was sealed with the Nikon logo and on opening you will find the camera, len and other accessories neatly packed in air bubble packs.If you are a novice to the world of photography, I suggest read the manual and go through the instructions before operating the camera.Coming to the camera its really compact in size and offers a beautiful display of 3inch. Since I am writing this review after only a day I am not able to access all the features of the camera but by reading the manual I clicked some good shots.A prime lens and a 70-300mm is what you will be needing in the future. Till then keep clicking.Don't forget to validate your warranty card in the Nikon Authorised Service Facility for your 2 yrs warranty.Amazon offers this product at a price lower than other online sites. At least that's what I got!!!Thanks for reading.",
               "rating":5.0,
               "usefulness":0.8823529411764706,
               "title":"Stunning!, 11 June 2014"
            },
            {
               "body":"purchaced the device ..after 2 days..aprox 100 clicks there was an error on screen (press shutter release button again) pressed the shutter button but in vain.resterted the device but not possible to click.not possible to view playback.as this a major defect the retailer should go through it.coz may be the shutter button jamed or any hardware problem may persist.amznJQ.onReady('jQuery', function() {amznJQ.available('popover', function() {var widgetDom = jQuery(\"#R33FL1C6SELRHF_imageSection_F1077680-E292-11E4-9BF8-770D34318D83\");var images = widgetDom.find(\".review-image-thumbnail\");for (var c=0;c<images.length;c++) {var imageURL = jQuery(images[c]).attr(\"large-image-url\");jQuery(images[c]).amazonPopoverTrigger({showOnHover:true,literalContent: '<img src=\"'+ imageURL +'\" style=\"max-width:100%;max-height:100%;\">'});}});});",
               "rating":2.0,
               "usefulness":1.0,
               "title":"purchaced the device.. after 2 days.. ..., 17 March 2015"
            },
            {
               "body":"My long wish to buy a DSLR is finally over. I'm fond of photography but could never afford a DSLR. Thanks to amazon with such attractive price my long wish and hobby got a green ticket. I have searched  a lot about DSLR camera and finally settled on Nikon D3200. I must say this  product is awesome if you are thorough with its features. My DSLR was delivered  before time and even I got 10% cash back(bought via HDFC credit) after 2 months. The camera was very well packed. High picture quality and  just wow pictures are saved as a memory. Only one drawback is its lens (18-55mm) less zoom, this is only reason why price of this DSLR is low. Higher range of DSLR haveMy long wish to buy a DSLR is finally over. I'm fond of photography but never could afford a DSLR. Thanks to amazon with such attractive price my long wish and hobby got a green ticket. I have searched  a lot about DSLR camera and finally settled on Nikon D3200. I must say this  product is awesome if you are thorough with its features. My DSLR was delivered  before time and even I got 10% cash back(bought via HDFC credit) after 2 months. The camera was very well packed. High picture quality and  just wow pictures are saved as a memory. Only one drawback is its lens (18-55mm) less zoom, this is only reason why price of this DSLR is low. Higher range of DSLR have higher version of zoom(18-105 mm VR kit lens). Overall good portrait pictures, but no for wildlife photography. higher version of zoom(18-105 mm VR kit lens). Overall good for portrait pictures, but no for wildlife photography.",
               "rating":4.0,
               "usefulness":1.0,
               "title":"Good for potrait clicks..!!, 24 January 2015"
            },
            {
               "body":"I selected the Nikon D 3200 after comparing all the online shopping websites and reviews.i got the best deal on Amazon.i was very impressed with delivery of the product.i placed the order in the evening and next morning the product was delivered,however I used the camera only once, while using the battery drained out so I was not able to adjust the lens ring and took it off the body and when I charged the battery and wanted to use the camera there was some noise coming from the lens and after fitting the lens on body it was not zooming in or out,so took the lens to a authorised servicing center in Pune.they checked it and directly told it a physical damage and will not be covered in warranty.i believe it is a manufacturing defect and the product was not mishandled or dropped.please look into this issue.",
               "rating":4.0,
               "usefulness":1.0,
               "title":"Lens not working, 14 January 2015"
            },
            {
               "body":"hello, i bought Nikon D3200 from Amazon on 2nd -NOV-14. received the product well packed.. delivered safely and on time. this is my first DSLR. i am facing problem with my camera's battery. i fully charged it as instructed on day1.. next day when i began clicking , after 20 shots sign of low battery started blinking.. is this bcoz of a new battery or this is a defective battery.. i called up at Nikon service centre. they said Warranty is not applicable on battery and other accessories...",
               "rating":3.0,
               "usefulness":0.8571428571428571,
               "title":"product is okay.., 4 November 2014"
            },
            {
               "body":"I was always fond of photography, but never could afford a DSLR. So tried very hard to get the most out of my point and shoot for years. Well, after saving bit by bit, I bought this camera and this feels something which I can't express in words. I bought it from Amazon because the price was about 3K low than other online stores. I must say this product is an absolute beauty and will bring smile to your face after every shot.",
               "rating":5.0,
               "usefulness":0.8260869565217391,
               "title":"Awesome camera, my baby :), 29 August 2014"
            }
         ],
         "avg_rating":4.5
      },
      "specs":{
         "Item model number":"D3200",
         "Display Resolution Maximum":"1080p Full HD",
         "Battery Cell Composition":"Lithium Ion",
         "Date First Available":"25 April 2014",
         "Has Self Timer":"Yes",
         "Flash Modes Description":"Auto, auto with red-eye reduction, auto slow sync, auto slow sync with red-eye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off",
         "Optical Zoom":"3 X",
         "Product Dimensions":"12.5 x 9.6 x 7.7 cm",
         "img":"http://ecx.images-amazon.com/images/I/41gggAuRCnL._SX300_.jpg",
         "ASIN":"B00JXEL4YA",
         "Brand":"Nikon",
         "Batteries Included":"Yes",
         "Max Resolution":"24.20 Megapixels",
         "Additional Features":"24.2MP, 3inch screen, Full HD Video",
         "Screen Size":"3 Inches",
         "Viewfinder Type":"Optical",
         "Included Components":"EN-EL14 rechargeable Li-ion battery (with terminal cover), MH-24 battery charger, AN-DC3 strap, EG-CP14 audio/video cable, UC-E17 USB cable, DK-5 eyepiece cap, BS-1 accessory shoe cover, DK-20 rubber eyecup, BF-1B body cap, view NX 2 CD-ROM, reference CD, AF-S 18-55mm VR Kit lens, Memory card and camera bag",
         "Memory Slots Available":"1",
         "Max Shutter Speed":"0.00025 Seconds",
         "Video Capture Resolution":"1920x1080",
         "Batteries Required":"Yes",
         "price":23643.0,
         "Optical Sensor Resolution":"24.2 Megapixels",
         "Connector Type":"usb",
         "Item Weight":"2.1 Kg",
         "Continuous Shooting Speed":"3.00",
         "Has Auto Focus":"Yes",
         "Model":"D3200",
         "Min Focal Length":"18 Millimeters",
         "Display Type":"LCD",
         "Number Of Items":"1",
         "Min Shutter Speed":"30 seconds",
         "Image Stabilization":"Digital",
         "Digital Zoom":"5 X",
         "Display Technology":"LCD"
      }
   },
   "d5200":{
      "url":"http://www.amazon.in/Nikon-D5200-24-1MP-Digital-Camera/dp/B00JM4VAC2",
      "reviews":{
         "reviews":[
            {
               "body":"I was basically waiting for the D3300 for its newer sensor and Image processor, but once it was released, I realised that the D5200 was the same price as the D3300 after a heavy discount.Overall, at this price this is one of the best cameras available.1. Great image quality2. Low noise at high ISOs. I generally don't see any noise till ISO 3200, but even at ISO 6400, noise is minimum and can generally be removed using DXO 93. Continuous shooting is nice. I can shoot indefinitely at around 2-3fps (RAW) using a Sandisk 90Mbps card4. Battery life is good. I can easily get by with one full day even with a Dawmtech GPS module attached. However, for people who want to get a second battery, I suggest them to get the EN-EL14A instead, as it provides more shots per charge5. In Camera HDR is more of a gimmick. It doesn't account for movement between shots and the resulting Dynamic Range isn't quite high. Better to manually bracket shots at -2,0,+2 and use a software like Photomatix for HDR.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Great buy, for this price, 16 March 2014"
            },
            {
               "body":"Was in a great confusion whether to buy Nikon d5200 or Canon 600d. After going through millions of reviews and youtube videos on the internet I decided to go with Nikon d5200, And I am really happy that I made the right decision. I was a novice who had no knowledge of Dslr photography what so ever. But the UI (User Interface) of this camera is so amazing that even a semi literate person can operate it easliy. Coming to specs, this cam beats the specs of even costlier Nikon and Canon Dslrs. It has 39 focal points( Which is available only on High end Nikon and Canon dslrs, >70k) which is a greatest advantage of this dslr, You can literally focus at any corner of your screen!! I don't know whether pixels matter in DSLR but it is 24.1 MP !!! that amazing.I have been using for a month now, and I had been to Western Ghats for good photography (With my Nikon 70-300 mm lens). The cam produced some of the best images you can ever imagine. I started feeling that I was a pro at this :D. Since I wanted to capture those precious moments of animals and birds, its very important to have a better frames per second shots in your cam and nikon d5200 beats even some of the high end camera in this aspect. It has 5 fps which is really really helpful when your photographing in the wild.The rotating screen is also a very good advantage to have in your camera when you are photographing at awkward angles,Which the nikon d5200 has.These were some of the features that I as a novice felt really useful.I'd like to add that the D5200 is Nikons Finest camera for independent film making in this or the Full Frame sensor classes. This camera is able to out perform its rivals in low light environments. Its able to provide excellent images at 1920 x 1080p (60, 50, 30, 25, 24 fps).All in all, this dslr is probably the best return of investment deal that I have made so far. This is undoubtedly one of the best dslrs in the market for beginners and mid level photographers.!! chao !! :)",
               "rating":5.0,
               "usefulness":0.9411764705882353,
               "title":"Best Return of Investment deal that I have made till now, Nikon d5200 - Beats even some of the high end dslrs out there!!, 24 August 2014"
            },
            {
               "body":"First to say that \"Excellent customer service by amazon. Hats off to them. No. 1 in customer service. Missing part was instantly refunded. This can't be find any where else. The best.\"D5200 is a major upgrade from previous model D5100. After waiting for 2 months I finally purchased and I felt that it was worth waiting for it.. Ergonomics wise I feel very good in my hands.They have upgraded to 9 cross type auto focus points compared to 1 in previous one.Video quality has been improved and in manual mode one can control ISO and shutter speed with ease.New feature of using it with WR-R10 will be a plus point to those who want wireless.Megapixel has been upgraded from 16mp to 24mp though I am not a pixel peeper..In nut and shell I can say that it has stolen most of the qualities of D7000 that includes 39 autofocus. Ofcource at this price no company would give you a metal body with prosumer grade dslr qualities .Cons:The Kit Lens 18-55 is a waste for money.The strap supplied is not up to the mark",
               "rating":4.0,
               "usefulness":1.0,
               "title":"Excellent customer service by amazon & a good product., 15 December 2014"
            },
            {
               "body":"This is my 1st DSLR, happy to have bought one. after LOTS N LOTS N LOTS of research decided to go for it while comparing it with canon 600D and Nikon D3300. I had started out in the lookout for an advanced poinnt and shoot, almost finalized Sony HX400V a day and Fujifilm HS50SX the other day, but then decided to go for a DSLR, and a DSLR is a DSLR. Just dont think and go for it. You will love whatever you click. Flip out screen is a handy feature and so i would suggest you to go for 5XXX series instead of 3XXX series. Research as much as you can so that your purchase becomes 'your' decision. Nikon low light sensitivity is superb, camera bag provided is really good. I have handled canon 600D as well, so want to clarify the myth about Canon being more user friendly UI. Nikon's interface I found to be equally easy, just needed a couple of days to get used to it.One strong recommendation which I can make only now after owning D5200 -Buy D5100 instead of D5200, its coming for 23K now, and invest in a prime or telephoto lens. My photographer friends have D5100 and I am at least a year away from taking pictures as good as they click, so its about where you stand and what you click. A better camera does not make you a better photographer.Hope you make the best choice and most importantly 'are satisfied' with it.Happy shopping...Happy shooting :)amznJQ.onReady('jQuery', function() {amznJQ.available('popover', function() {var widgetDom = jQuery(\"#RD4N9AJT0QIPQ_imageSection_E460AE74-E292-11E4-9B1C-9431377E014D\");var images = widgetDom.find(\".review-image-thumbnail\");for (var c=0;c<images.length;c++) {var imageURL = jQuery(images[c]).attr(\"large-image-url\");jQuery(images[c]).amazonPopoverTrigger({showOnHover:true,literalContent: '<img src=\"'+ imageURL +'\" style=\"max-width:100%;max-height:100%;\">'});}});});",
               "rating":5.0,
               "usefulness":0.9090909090909091,
               "title":"I am a happy customer :), 29 January 2015"
            },
            {
               "body":"Excellent camera.  Earlier I was using D3100 with 18-55mm lens; being dissatisfied with the performance of the lens, ordered 35mm prime lens.  Then the performance was good, although I was not satisfied as the noise in low light condition is high and pixels were not much clear as I expected.  Then I have used my elder brother's camera (D5100), which has captured more than 50,000 images, and made a comparison with D5100, it was excellent.  I had decided to sell D3100 with 18-55mm lens, and decided as well to buy D5100 with 18-55mm lens.  After selling the earlier camera, I was confused between D5100 vs. D3300.  One of my friends suggested me to buy any camera of D5000 series.  I have order D5200 with 18-55 VR-II, and I am satisfied with picture quality, clear pixels, excellent colours, looking better, better screen resolutation, HDR, various D-light options, low noise in low light.  If any one ask me for suggestion, I would suggestion D5100, because it has excellent picture quality and you can save Rs.10,000/-.  If you insert a fast memory card, you can get fast saving of images by the camera, whether it has Expeed- 2, 3, 4.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Excellent camera. Earlier I was using D3100 with 18-55mm ..., 18 March 2015"
            },
            {
               "body":"i am more concerned about the warranty if i will buy any Nikon Camera from amazon.inAs It was clearly mentioned in Nikon site (links are given below) that\"Please note that E-Commerce Websites are not our authorized partner/dealer........\"Will Amazon team or vendor put some light on the same. Early response is highly appreciated.Link 1: [...]Link 2: [...]",
               "rating":4.0,
               "usefulness":0.8709677419354839,
               "title":"concerned about the warranty. As Nikon said, \" E-Commerce Websites are not our authorized partner/dealer \", 20 October 2014"
            },
            {
               "body":"The camera takes very good pictures.Having spent a lot of time in research, let me answer a few questions.1. No difference between Nikon and Canon. Both have parallel models in each price range. But you can avoid Canon 1200D. It doesn't have auto sensor cleaning.2. At this price range, buy Canon if you have access to a lot of old canon lenses which don't have an in-lens focus motor. (Unlike Canon, Nikon entry-level cameras do not have a focus motor in the body).3. If the above is not the case, then don't narrow your options to a single manufacturer. I bought Nikon because all my friends have Nikon and between us, we have a lot of lenses we can exchange. Most new lenses come with in-lens focus motors.4.  Autofocus speed is more a function of the lens itself, rather than your Camera's autofocus system.5. Buy the camera giving you the best discounted price and save your money for buying lenses.6. You will need to buy a 35mm prime and a 55-200mm VR lens to get your hobby going. So keep money aside for that and don't spend all your money on the body.7. In the low-cost range, buy only Nikon/ Canon lenses and avoid third party lenses for your Nikon/Canon camera.8. Super zoom lenses like 18-200mm will always have flaws at their limits.9./If this is going to be your second DSLR, buy semi pro camera like D7000/7100 or Canon equivalents. (But these will be bulky cameras).10. Happy shooting!",
               "rating":5.0,
               "usefulness":null,
               "title":"A few words of advice for those of you researching..., 19 March 2015"
            },
            {
               "body":"Got a genuine piece, Made in Thailand, got registered on Nikon India site for warranty without issue. Nice packing and in-time delivery. Good deal at the price. Nice job Sellar and Amazon.Great Camera. There are tons of reviews out there so I won't repeat the tired clich. Been playing around with it for two days. This is my first camera. The camera is only as good as the photographer and its overwhelmingly good for any newbie out there so no issues there. Its the best for this price in the market. The latest version D5300 have 2-3 new features, but I don't think its worth the extra INR 10-12k.Only some small annoying things which Nikon could improve on:1. Can use manual focus while lens locked in AF mode. Have to change the switch position of the AF/M button. Really annoying. It should allow for manual focus even with the switch is in AF selection.2. Bag provided is not good enough. Its belt is too short, feels like ladies purse. Inner space is enough for camera + 2 lenses. Two outer pockets seem inadequate though.3. Camera strap doesn't feel good enough. Could be better.4. Battery charger is too big, but without a wire. But the plug attachment on is not easy to remove and with it attached the charger doesn't fit in the small pockets of the bag. Little annoying I thought.",
               "rating":5.0,
               "usefulness":null,
               "title":"A kid got his favorite candy..!!, 5 January 2015"
            },
            {
               "body":"Hello friends,Its my dream coming true with this tiny heaven. After reviewing of several months , just to choose a brand and a product.. i have gone to this NIKON D5200. Awesome product. Great Result.. I recommend personally. \"This is not entry level.. \" This is a semi professional camera.. Can be used for Shortfilms too. so no needs to worry about quality and all. Kit lens works perfectly.. looking for the next level of 18-104 or 18-135 or 55-200 mm len. you will come to know later why 18 mm?(for wide) . What ever the camera you buy, the picture , it depends how we shoot.. so no matter costly/worthy , its our hand to produce great pics.. only camera will not produce great images , the yway you look an object is matter as well as a software which helps to enhance your coloring , to be viewed the pics..All the best for beginners.. Even i was beginner.. now also .. learn Technics / tips/tricks that will help lot.. I love the product much. :) :) :)",
               "rating":5.0,
               "usefulness":null,
               "title":"Simply Great!!!, 23 November 2014"
            },
            {
               "body":"if there were more stars to give i would have given more than 5 stars , dont have tome so will write a quick one.1) the product arrived within 24 hours , yes !!! within 24 hours. it was home with TAT of ~14 hours, can you believe that? i couldn't.2) the packing was simply awesome, they knew how to value an expensive product and delivered it with lots of TLC.3) the advertisement said \"VR\" kit lens which is old technology like the model of the camera BUT i was pleasantly surprised to see a VR II Kit lens which comes along with D5300 the upgraded model , simply made my day !!4) i feel guilty that i bought from an MNC, when local flipkart was there.. but unfortunately Flipkart needs to learn from amazon on how to do e-business. (But that's a story for another day)",
               "rating":5.0,
               "usefulness":null,
               "title":"Flipkart has some catching up to do., 29 November 2014"
            }
         ],
         "avg_rating":4.7
      },
      "specs":{
         "Item model number":"D5200",
         "Display Resolution Maximum":"1080p Full HD",
         "Battery Cell Composition":"Lithium Ion",
         "Date First Available":"11 April 2014",
         "Has Image Stabilization":"Yes",
         "Min Aperture":"5.60 f_stop",
         "Optical Zoom":"3 X",
         "Product Dimensions":"31 x 19.5 x 20.8 cm",
         "img":"http://ecx.images-amazon.com/images/I/41jj8vliejL._SX300_.jpg",
         "Brand":"Nikon",
         "Batteries Included":"Yes",
         "Max Resolution":"24.10 Megapixels",
         "Additional Features":"Body With Lens, 3.0 in., 24.1 MP, CMOS, f/3.5-f5.6",
         "Screen Size":"3.2 Inches",
         "Viewfinder Type":"Optical",
         "Included Components":"Nikon D5200 Digital SLR Body, DSLR Bag,  AF-S 18-55mm VR II Kit Lens, 8GB SD Card, EN-EL14 Rechargeable Li-ion Battery, Battery Charger, Strap, USB Cable, Audio/Video Cable, Eyepiece Cap, Accessory Shoe Cover, Rubber Eyecup, Body Cap, ViewNX 2 CD-ROM and User's Manual.",
         "ASIN":"B00JM4VAC2",
         "Video Capture Resolution":"1920x1080",
         "Batteries Required":"Yes",
         "price":35033.0,
         "Optical Sensor Resolution":"24.1 Megapixels",
         "Connector Type":"usb",
         "Item Weight":"503 g",
         "Continuous Shooting Speed":"5",
         "Model":"D5200",
         "Resolution":"24.1 megapixels",
         "Max Shutter Speed":"1/4000 Sec Seconds",
         "Display Type":"LCD",
         "Number Of Items":"1",
         "Min Shutter Speed":"30 Seconds",
         "Min Focal Length":"18 Millimeters",
         "Image Stabilization":"Digital",
         "Digital Zoom":"3 X",
         "Display Technology":"LCD"
      }
   },
   "d7100":{
      "url":"http://www.amazon.in/Nikon-D7100-24-1MP-Digital-18-140mm/dp/B00KBQI550",
      "reviews":{
         "reviews":[
            {
               "body":"First of all i'd like to write about the packaging of the camera.. and the packaging was unbelievably pathetic!! amazon you transport 1 lac worth of camera wrapped in a bubble wrap which has just 10 bubbles!!  and out of which only 4 had air in them!! leaving plenty of space for the camera to take hits in the box while the transportation?? and the amazon box in which you packed the camera was partially open!! i didn't expect this kind of negligence from you amazon.. :( i donno how pathetically it was handled while shipping..but thanks to Nikon for their great packing (better than amazons, relatively !!). the camera works as i expected!! its a awesome gear which will help you to take your photography to the new limit.. cant say anything more about the camera as i just started to work with it and I am not a pro yet to judge it..!! :) and of course It is the power and agility to leap forward as Nikon says.!!! great imaging machine Nikon..!! :) Just love it..!!",
               "rating":5.0,
               "usefulness":0.8461538461538461,
               "title":"Just love the mid-range beast!!!, 23 May 2014"
            },
            {
               "body":"The capabilities of this camera is  close to a Full frame sensor camera.The results are outstanding.Always remember it is the lens that make the difference.",
               "rating":5.0,
               "usefulness":0.8,
               "title":"A professional line APSC camera, 8 July 2014"
            },
            {
               "body":"The camera was as per the description, the packaging would have been better by Amazon",
               "rating":4.0,
               "usefulness":1.0,
               "title":"the packaging would have been better by, 4 January 2015"
            },
            {
               "body":"Hey amazon price here is the best we can have, but what about the warranty !! No where nothing mentioned about warranty?? Isn't there any??I'm interested & impressed with this cam but without any warranty how can any one invest on such an expensive buy !!please reply !!",
               "rating":5.0,
               "usefulness":0.7,
               "title":"Warranty ???, 24 May 2014"
            },
            {
               "body":"Best DSLR in chopped sensor range. Although features like wifi, gps and articulated screen not present which can be found in canon in the range.",
               "rating":4.0,
               "usefulness":0.6666666666666666,
               "title":"Best DSLR in chopped sensor range, 22 September 2014"
            },
            {
               "body":"Superb camera. Only which i am facing is the noise grain at iso more than 400",
               "rating":5.0,
               "usefulness":0.5,
               "title":"Good buy, 24 October 2014"
            },
            {
               "body":"Added Jewel in my Collection!!Amazing Camera... Friendly Features, modes and Great Results!!The Target was for actual color reproduction !!Fully Impressed!!",
               "rating":5.0,
               "usefulness":0.0,
               "title":"Excellent Mid Range Professional DSLR, 17 May 2014"
            },
            {
               "body":"Will review after some time",
               "rating":5.0,
               "usefulness":0.0,
               "title":"Five Stars, 17 November 2014"
            },
            {
               "body":"Simply awesome",
               "rating":5.0,
               "usefulness":0.0,
               "title":"Five Stars, 30 October 2014"
            }
         ],
         "avg_rating":4.8
      },
      "specs":{
         "Item model number":"D7100",
         "Optical Zoom":"5.8 X",
         "Display Type":"LCD",
         "Date First Available":"14 May 2014",
         "Min Focal Length":"18 Millimeters",
         "img":"http://ecx.images-amazon.com/images/I/31asQY6ASkL._SX300_.jpg",
         "ASIN":"B00KBQI550",
         "Memory Storage Capacity":"32 GB",
         "Brand":"Nikon",
         "Min Shutter Speed":"30 seconds",
         "Optical Sensor Resolution":"24.1 Megapixels",
         "Has Image Stabilization":"No",
         "Item Weight":"762 g",
         "Has Self Timer":"Yes",
         "Has Auto Focus":"Yes",
         "price":86799.0,
         "Model":"D7100",
         "Flash Modes Description":"Auto, auto with red-eye reduction, auto slow sync, auto slow sync with red-eye reduction, fill-flash, red-eye reduction, slow sync, slow sync with red-eye reduction, rear-curtain with slow sync, rear-curtain sync, off, auto FP high-speed sync supported",
         "Screen Size":"3.2 Inches",
         "Product Dimensions":"7.6 x 13.5 x 10.7 cm",
         "Included Components":"Nikon D7100 Digital SLR Body, EN-EL15 Rechargeable Li-ion Battery (with terminal Cover), MH-25 Battery Charger, DK-5 Eyepiece Cap, AN-DC1 Strap, UC-E6 USB Cable, BS-1 Accessory Shoe Cover, DK-23 Rubber Eyecup, BF-1B Body Cap, View NX 2 CD, User's Manual, 8GB Card and Camera Bag, AF-S 18-140mm VR Lens"
      }
   },
   "d90":{
      "url":"http://www.amazon.in/Nikon-D90-12-3MP-Digital-18-105mm/dp/B00JM4WGUW",
      "reviews":{
         "reviews":[
            {
               "body":"D90is overpriced for what it offers, and poor video capability. For almost the same price you can get a Canon 70D, which has more features and far better video capability.With Nikon, D3300 is much better value. All of tem can take good pictures of static subjects. In sports and wildlife where subjects are moving, Canon shines.",
               "rating":3.0,
               "usefulness":0.6666666666666666,
               "title":"Overpriced, 25 February 2015"
            },
            {
               "body":"overpriced....seriously look on the price...",
               "rating":3.0,
               "usefulness":0.6666666666666666,
               "title":"overpriced.... seriously look on the price ..., 13 March 2015"
            },
            {
               "body":"IN DSLRS IT IS THE BEST PRODUCTS WITH EXCELLENT SERVICE FACILITIES AND WITH EXTRA ORDINARY FEATURES IT HAS AND IT IS FRIENDLY FEATURES IT HAS WITH REASONABILY PRICED.",
               "rating":4.0,
               "usefulness":0.4,
               "title":"IN DLSR THE BEST PRODUCT., 17 May 2014"
            },
            {
               "body":"Very good product",
               "rating":5.0,
               "usefulness":0.25,
               "title":"Five Stars, 4 March 2015"
            },
            {
               "body":"IN DSLR MODEL THIS IS ONE OF THE FINEST PRODUCT AT MOST COMPETITIVE PRICE WITH EXCELLENT SERVICE FACILITIES AVAILABLE EVERY WHERE IN iNDIA",
               "rating":4.0,
               "usefulness":0.25,
               "title":"DLSR MODEL, 3 May 2014"
            }
         ],
         "avg_rating":3.8
      },
      "specs":{
         "Item model number":"D90",
         "Display Resolution Maximum":"720p HD Ready",
         "Battery Cell Composition":"Lithium Ion",
         "Date First Available":"11 April 2014",
         "Flash Modes Description":"Auto",
         "Min Aperture":"5.60 f_stop",
         "Optical Zoom":"1 X",
         "Product Dimensions":"33 x 28.4 x 21.4 cm",
         "img":"http://ecx.images-amazon.com/images/I/414KrvRNs3L._SX300_.jpg",
         "Brand":"Nikon",
         "Batteries Included":"Yes",
         "Additional Features":"12.3 Megapixel, 3 inch, HD Recording, CMOS Image Sensor",
         "Screen Size":"3 Inches",
         "Viewfinder Type":"Optical",
         "Included Components":"Nikon D90 Digital SLR Body, AF-S 18-105mm VR Lens, Rechargeable Li-ion Battery EN-EL3e, Quick Charger MH-18a, USB Cable UC-E4, Video Cable EG-D2, Camera Strap AN-DC1, Body Cap BF-1A, Accessory Shoe Cover BS-1, LCD Monitor Cover BM-10, Software Suite CD-ROM, 8GB Card and Camera Bag.",
         "Memory Slots Available":"1",
         "ASIN":"B00JM4WGUW",
         "Video Capture Resolution":"1280 x 720",
         "price":49854.0,
         "Optical Sensor Resolution":"12.3 Megapixels",
         "Connector Type":"usb",
         "Item Weight":"621 g",
         "Continuous Shooting Speed":"4.00",
         "Model":"D90",
         "Resolution":"12.3 megapixels",
         "Max Shutter Speed":"1/4000 Sec Seconds",
         "Display Type":"LCD",
         "Number Of Items":"1",
         "Min Shutter Speed":"30 Seconds",
         "Min Focal Length":"18 Millimeters",
         "Image Stabilization":"Digital",
         "Display Technology":"LCD"
      }
   },
   "d610":{
      "url":"http://www.amazon.in/Nikon-D610-Digital-Camera-24-85mm/dp/B00HY9COFY",
      "reviews":{
         "reviews":[
            {
               "body":"Great Camera. Great service by Amazon! I was in two minds between the D610 and the D7100 due to budget constraints and overall performance of both (not considering sensor size) and can safely say this was worth the extra money. The camera is a rugged, sharp and precise piece of equipment that will be my primary imaging device for the next few years.I upgraded from a D3100 so it was a step up on too many levels. Having said that, I took this camera to an extremely challenging rain-forest expedition right out of the box with 6 days of shooting in pouring rain, leaving the camera fully drenched, mostly without any rain protection or umbrella; and this thing just kept shooting without any glitches. Auofocus performance is great, but a little weak in poor lighting.Pros: 1. Great build and finish. Feels solid and rugged.  2. Controls can require some getting used to, but is user friendly  3. Amazing dynamic range and very low noise at high ISO  4. Timelapse, HDR, bracketing, multi-exposure and many other advanced functionality  5 Kickass battery performance  6. U1/U2 settingsDid I mention the obvious - Sheer brilliant image quality. :)Cons: 1. Low light lens hunt  2. No CF card slot  3. Slow shutter speed  (1/4000 of a second, but really doesn't matter)  4. Shorter than expected buffer capacityConclusion:  The camera is worth every penny spent. The eventual upgrade from APS-C to 35mm sensors itself is a huge upgrade. The camera also has its fair share of bad press due to the D600's oil/dust spot issues, but one needs to look through highly opinionated forums and famous camera reviewers who share a lot of their bias and propaganda. The Nikon D610 was able to take on 5 days of the worst usage in the wettest rain-forests of India, thorough horrid light conditions, abuse and rain; and in-spite of this was able to deliver great image quality and prove its rugged worth. This one gets a 5 stars from me, just for the product.Delivery from Amazon required followup and was delivered right after. There were also no accessories provided (bag/SD-card) apart from the box, but then again for the price that I managed to bag this deal was an achievement in itself. The lowest price for the D610 ever. 5 stars to the vendor and Amazon as well. :)CheersAtul Haldankar",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Worth the money and the full frame sensor upgrade!, 1 August 2014"
            },
            {
               "body":"The item was fulfilled by Amazon.in (and was offering free delivery) I opted for a one-day delivery...!The packaging was excellent...!!! Amazon decided to use a much bigger external box filled with lots of air bags so that the delivery person will take extra care (because of the 4-time as big package size).D610 is one of the best in Nikon lineage (and best in its category). One can find hoards of reviews in other sites.The pricing was very competitive, much lesser than the US prices, and other on-line prices. I also ordered (and received) a 24-70 f2.8 through Amazon to go with D610, which was also quite a deal (compared to the US prices, and that quoted in other on-line stores).To get the best out of these modern sensors (both full-frame and DX Cameras), please get a new lens also. (technology is changing fast indeed...!)Keep it up Amazon(in). Absolutely delighted...!!!:-)",
               "rating":5.0,
               "usefulness":null,
               "title":"Absolutely Delighted...!, 27 June 2014"
            },
            {
               "body":"Camera is great, but dont expect the free bag and the memory card. I did not recieve the bag and the memory card from amazon and has been the same complaint across the reviews..  When complained I was told it will not be provided and was given a refund of rs.500!The bag is a required accessory and is given by nikon. Not sure why it was with held.I am giving a 1 star to amazon because of this.",
               "rating":5.0,
               "usefulness":0.6666666666666666,
               "title":"No bag or memory card will be given!, 27 May 2014"
            },
            {
               "body":"last saturday, it was available for 1.28 lac, now the price increased... ! this is strange, is it normal for the price to increase so fast.",
               "rating":2.0,
               "usefulness":0.0,
               "title":"price increased?, 8 July 2014"
            },
            {
               "body":"The camera is D610 and deatails are.........EOS 100D has the lightest body of all APS-C DSLR cameras with interchangeable lenses (as of March 1, 2013, Canon)",
               "rating":5.0,
               "usefulness":0.0,
               "title":"Amazon-screwed up details..and wants to be India's top seller!!!, 11 May 2014"
            }
         ],
         "avg_rating":4.4
      },
      "specs":{
         "Item model number":"D610",
         "Optical Zoom":"3 X",
         "Screen Size":"3.2 Inches",
         "img":"http://ecx.images-amazon.com/images/I/41%2BQ9SaAAdL._SX300_.jpg",
         "Batteries Included":"Yes",
         "Batteries Required":"Yes",
         "Memory Storage Capacity":"32 GB",
         "Brand":"Nikon",
         "Date First Available":"20 January 2014",
         "Optical Sensor Resolution":"24.3 Megapixels",
         "Max Resolution":"24.30 Megapixels",
         "Item Weight":"748 g",
         "ASIN":"B00HY9COFY",
         "Includes AC Adapter":"Yes",
         "Model Name":"DSLR",
         "Model":"D610",
         "price":156999.0,
         "Resolution":"24.3 megapixels",
         "Product Dimensions":"14.1 x 11.3 x 8.2 cm",
         "Included Components":"Nikon D610 Digital SLR Body, BS-1 accessory shoe cover, DK-21 rubber eyecup, BM-14 monitor cover, BF-1B body cap, EN-EL15 rechargeable Li-ion battery (with terminal cover), MH-25 battery charger, DK-5 eyepiece cap, AN-DC10 strap, UC-E15 USB cable, ViewNX 2 CD, User Manual, Warranty Card"
      }
   },
   "d5500":{
      "url":"http://www.amazon.in/Nikon-D5500-DX-format-Digital-18-55mm/dp/B00RUBJKU8",
      "reviews":{
         "reviews":[
            {
               "body":"Great specs...only downside is the changing of iso in live view! Otherwise great camera ",
               "rating":4.0,
               "usefulness":null,
               "title":"Great battery life and touch screen, 15 March 2015"
            }
         ],
         "avg_rating":4.0
      },
      "specs":{
         "Item model number":"1546",
         "Optical Zoom":"3 X",
         "img":"http://ecx.images-amazon.com/images/I/51PZCc5fP4L._SX300_.jpg",
         "ASIN":"B00RUBJKU8",
         "Brand":"Nikon",
         "Date First Available":"25 February 2015",
         "Max Resolution":"24.2",
         "Has Image Stabilization":"Yes",
         "Item Weight":"1.3 Kg",
         "price":54449.0,
         "Model":"1546",
         "Hardware Interface":"AV",
         "Screen Size":"3.2 Inches",
         "Product Dimensions":"22.4 x 16.5 x 13.5 cm"
      }
   },
   "d7000":{
      "url":"http://www.amazon.in/Nikon-D7000-16-2MP-Digital-18-105mm/dp/B00K0D5CVY",
      "reviews":{
         "reviews":[
            {
               "body":"Got this awesome camera at a awesome price from Amazon. Thank you very much Amazon.Regarding the camera it's the best DX format camera you can get. Look at the Nikon timeline in Wikipedia (http://en.wikipedia.org/wiki/Template:Nikon_DSLR_cameras). Forget about D5200 or D5300 even if they claim to have a better sensor (Which is just a gimmick, you won't notice any difference), they lack professional controls. D7000 is the best Semi-Pro camera in this price range. U will get superb photo qualities at higher ISO.Pros:1. Kit lens is 18-105mm which has a market price around 17k and it has a superb optical quality unlike 18-55 mm (Even if you buy cheaper body like D5200 with this lens would cost more than what amazon offering for D7000 + Lens)2. AF motor inbuilt, so if you buy cheaper lens without AF motor (ex: 50mm 1.8D Prime Nikkor) the autofocus functionality would work perfectly. If you use D5200 or D5300 either you have to mannually focus or buy costly lens with AF motor built in.3. Has two memory card slots, one can be used for back ups.4. Plenty of buttons provided for controlling different settings directly like ISO, Apperture, metering mode etc. which comes very handy while taking shots.Cons:1. I have been using it for one month and I haven't found any cons of this camera, Only one thing I would like to mention that the camera is bit heavier than lower end DSLR models as it is build of Magnesium Alloy. But the weight of the camera also comes handy when you are using a heavy lens (like 70-300 mm VR), it helps to maintain stability while holding the lens. Try to carry the camera in a backpack.Regarding the warranty - Nikon recently posted in their web site that online sellers are not authorised Nikon reseller. I would like to mention that Amazon is a marketplace not a seller, when my camera arrived I checked the invoice, it was sold by \"J.J. Mehta & Sons\", I checked the Nikon website and found that the seller is a Nikon Authorised seller ar Mumbai. I registered my camera and lens at Nikon website and asked them if it has the 2 year Nikon India warranty, and they replied positively. :D Also I asked them that my warranty card is not stamped, Do I have to get it stamped, they replied that as I have bought it from a Nikon authorized seller there is no need to stamp it. :)",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Awesome camera - Best DX Format camera, 15 November 2014"
            },
            {
               "body":"the best semi pro camera ....which has all the advance feature to fullfill the need of a mid level photographer.i am glad i used amazon to buy it. excellent packing.....and delivery(two days before time)suggestion: please dont use GATI for delivery in west bengal region as they are too arrogant to deliver it to the address wrritten and ask to come and collect it",
               "rating":5.0,
               "usefulness":1.0,
               "title":"amazon is AMAZING, 29 May 2014"
            },
            {
               "body":"Thanks Amazon and PAY LESS for delivering the product in good condition within 4 days of online purchase (purchased on 03.05.2014 and delivered on the evening of 07.05.2014). Also got a good deal from PAY LESS. Very good packaging. Everything was there as mentioned - D7000 body,18-105mm lens, 55-200mm lens, nikon leather camera bag and other accessories. Bag is quite good. Don't know why some complained about it. But the bag is fit for the camera and one extra lens only.Took some pictures with both 18-105mm and 55-200mm lens. At a first glance the pictures are ok. Charged the battery overnight (8 hrs) before first use. The camera feels a bit heavy initially. But I think with time this will be ok. Camera has a good grip. Changing the lenses is easy.The camera feels real pro. Compared with D5300 and D90 before buying. It is good as a first DSLR. But it will also provide opportunities to advanced amateurs. Will definitely recommend it.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Simply awesome, 9 May 2014"
            },
            {
               "body":"You can't get a better camera at around ~50K! No camera comes even close to it at this price for image quality and features.Don't compare it to Nikon D5300 or Canon 60D (just because they're at similar price), they are also very good camera, but not professional.I used a D3200 before, that was also very good. Thought of a D7100, but bought this as I got an amusing deal from Amazon!Those who are confused about buying D3300 and D5300, go ahead with D3300 without a second thought, you don't need to spend extra 20K for a Fully articulated LCD, otherwise they are the same. The so called more auto-focus points in D5300 helps in nothing, you'll know after you use!You'll find tons of reviews and user guides for D7100 in internet....When comparing, most people often forget that Nikon D7000 has a weather-shield, which is almost a must for wildlife photography.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Most people often forget that Nikon D7000 has a weather-shield!, 8 April 2015"
            },
            {
               "body":"You just can't beat the build quality of a Nikon. I had 3 nikon lenses lying around from my old analog SLR and hence decided to go for a Nikon again.But... if you're in the market for a new DSLR and have no baggage like I did, I'd suggest you consider a good Canon. Their build doesn't look so great, but it's something about the colors from a Canon, which seem to just pop.Another piece of advise; Don't blindly go for the kit lens. Do a decent amount of research and pick the body and the lens separately if necessary. A good prime lens, despite all it's drawbacks, can, at the end of the day give you a picture which a kit lens never can.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"It's built like a pro. And has everything a pro would want., 28 January 2015"
            },
            {
               "body":"On time delivery and good packaging. Comes with all the in box accessories mentioned. SD Card is 8gb class 10. Not some cheap stuff! Bag is decent quality but a bit small. Verified shutter count and it was accurate to zero on arrival. (Because my brother bought his d5100 and it already had like 800 odd actuations). Techno Mart seller is good. Offered the best price 53k. On time delivery.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Excellent packaging and delivery, 6 September 2014"
            },
            {
               "body":"One-day delivery was missed but was promptly refunded by Amazon. However, delivery promises must be honored at all costs. As far as the camera is concerned. Its as expected. Super like. Very securely packaged and as described. All accessories were in order. Nikon D7000 now is a four-year old model since Nikon has released newer bodies since. Although camera bodies don't change much unless you are at the cutting edge of photography and older bodies mean cheaper prices. I think at the present price, D7000 is an excellent buy for amateurs, can't talk of professionals. Excellent photos even in auto mode. Still to try the advanced controls.",
               "rating":5.0,
               "usefulness":null,
               "title":"Excellent product at an excellent price, 13 November 2014"
            },
            {
               "body":"A wonderful camera with outstanding performance. All me lenses from my D90 fit this camera so it was a allround saving. The camera has a very good battery life with the EN EL 15 batery.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"D 7000, 30 September 2013"
            },
            {
               "body":"Received a sealed pack with all promised items (8gb card and camera bag of good quality) and with warranty cards and manuals.Initially the lens rare cap was jammed which bothered me a lot and made me call amazon and seller (who responded properly., thanks for that) and I was ready to check with service center for opening the cap or in worst case returning the product. But after trying for some time around 1 hr and by few of my friends., it got opened.. lucky with that. Never going to put that cap back.. ;)But over all the product was Good !",
               "rating":5.0,
               "usefulness":null,
               "title":"Good as expected..., 18 September 2014"
            },
            {
               "body":"This is excellent camera to start with.Pros -1. Very sharp picture2. Heavy build quality.3. Built in AF motor - generally cheaper DSLR doesnt have it.4. Amazing batter backup, no need to buy extra backup battery.5. Weather sealedcons- 1. Little heavy but you will be used to it and you will count it in pros when u use it with big lenses ;)",
               "rating":5.0,
               "usefulness":null,
               "title":"Best camera to start with., 7 January 2015"
            }
         ],
         "avg_rating":4.4
      },
      "specs":{
         "Item model number":"D7000",
         "Batteries:":"1 Lithium ion batteries required. (included)",
         "Battery Cell Composition":"Lithium Ion",
         "Date First Available":"29 April 2014",
         "Has Self Timer":"Yes",
         "Has Image Stabilization":"No",
         "Flash Modes Description":"Auto",
         "Min Aperture":"38 f_stop",
         "Optical Zoom":"3 X",
         "Product Dimensions":"7.7 x 13.2 x 10.5 cm",
         "img":"http://ecx.images-amazon.com/images/I/41Cnp8SsuiL._SY300_.jpg",
         "Brand":"Nikon",
         "Batteries Included":"Yes",
         "Additional Features":"16.2 Megapixel Camera, 3 inch, Full HD Recording, CMOS Image Sensor",
         "Screen Size":"3 Inches",
         "Viewfinder Type":"Optical",
         "Included Components":"Rechargeable Li-ion battery EN-EL15, quick charger MH-25, rubber eyecup DK-21, camera strap AN-DC1, body cap BF-1B, eyepiece cap DK-5, accessory shoe cover BS-1, USB cable UC-E4, AF-S 18-105mm VR kit lens, video cable EG-D2 and view NX 2 CD",
         "Memory Slots Available":"1",
         "ASIN":"B00K0D5CVY",
         "Video Capture Resolution":"1920x1080",
         "price":55649.0,
         "Optical Sensor Resolution":"16.2 Megapixels",
         "Display Resolution Maximum":"1080p Full HD",
         "Connector Type":"usb",
         "Item Weight":"2.5 Kg",
         "Continuous Shooting Speed":"6.00",
         "Has Auto Focus":"Yes",
         "Model":"D7000",
         "Has Redeye Reduction":"Yes",
         "Resolution":"16.2 megapixels",
         "Max Shutter Speed":"1/8000s Seconds",
         "Display Type":"LCD",
         "Number Of Items":"1",
         "Min Shutter Speed":"30 Seconds",
         "Min Focal Length":"18 Millimeters",
         "Image Stabilization":"Digital",
         "Display Technology":"LCD"
      }
   },
   "d5100":{
      "url":"http://www.amazon.in/Nikon-D5100-16-2MP-Digital-18-55mm/dp/B00JM4V3M4",
      "reviews":{
         "reviews":[
            {
               "body":"After a lot of research (I mean a lot) I choose the D5100 over the other competitors - Canon D600, Nikon 5200, Nikon 3200 & Nikon 3300. Here is a quick comparison.The D5100 is superior to the Canon D600 in almost all respects. One major reason to go for the Nikon over Canon is the auto focus motor is built-in the lens rather than the camera body. Yes this makes the lens more expensive but it makes a good difference as per my research to have the AF motor in the lens.D3200 (D3300 also) is extremely close to the D5100 but only reason to not go for the D3200 though it is the newer model is that it does not have the flip screen which I fell is extremely necessary. I have used flip as well as fixed screens in the past and I know how valuable it is to have a flip screen. Though the D3200 has more megapixel than the D5100 it barely makes a difference in the picture quality. In fact the D5100 has a slightly larger sensor size than the D3200 which does make a difference and covers up the megapixel gap.D5200 is slightly better than the D5100 but not so much better to pay the huge price difference. However the D5100 has a slightly larger sensor size, longer battery life and it is slightly smaller. For the price difference of 11-12k I can get a good prime lens.In terms of lens for the D5100, I went for the Tamron 18-200mm f/3.5-6.3 XR Di II LD Aspherical IF Macro Zoom Lens which gives me the flexibility to shoot close ups as well as zoom without having to change the lens every time. Will invest in a prime lens as and when I feel the need. For now loving and enjoying the awesome pictures with my D5100 with the Tamron 18-200mm lens.Cheers!!Nelson",
               "rating":5.0,
               "usefulness":0.9830508474576272,
               "title":"One of the best camera with crystal clear images !!, 4 April 2014"
            },
            {
               "body":"Two weeks with D5100.Pros-1. Excellent image quality, just on par with D5200 & D5300. Believe me i tried all three camera with 35mm lens and the results were almost equal.2. Light weight & compact- Carrying dslr is pain in the ____. So D5100 is both compact & light weight as compare to D7000 and D7100. This is super important IMHO, you'll definitely going to enjoy this advantage.3. ISO settings are not limited unlike canon's 550D(Dumb).4. Far better build & picture quality than canon. Just pick up any nikon lens and you'll notice huge difference immediately.5. Amazing low light photography. Just freaking AMAZING.CONS- 1. None so far, speed could have been better but who cares for few millisecond.Tip- Get 35mm lens instead of 18-55mm and see the huge improvement in photography. Don't waste your money on D5200 & D5300, just get the good lenses.",
               "rating":5.0,
               "usefulness":0.9375,
               "title":"Excellent camera with amazing low light performance, 26 July 2014"
            },
            {
               "body":"This is my first camera. Yes, you read it right. I did not even own a point and shoot prior to owning this camera. However, i have good hands-on experience with quite a lot of PS cameras and few DSLRs (both Canon as well as Nikon). There is no point in arguing where Canon or Nikon is better, because both makes better cameras. Rather, i would like to have a discussion such as PS vs. Bridge vs. Crop DSLR vs. Full Frame DSLR. I chose mine based on few parameters like sensor size which allows capturing more light, low light performance, cost and D5100 excels in all these parameters.Although i brought the camera with kit lens, i would recommend buying it as body alone and buying a prime lens like 50mm 1.8G or 35mm 1.8G. You will definitely see day-night difference between the image sharpness and quality with these prime lenses. With these lenses you get fantastic bokeh effects at lower aperture values and crisp all rounded images at higher aperture values. And at last, my kit lens (18-55mm) is now lying back on the box it came with, which i should have avoided purchasing so that i would have saved quite few bucks.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"A perfect companion for beginners who are willing to grow their photography skills, 29 September 2014"
            },
            {
               "body":"Hi, I have complained earlier also. I am not able to register this product on Nikon India Website. I may not get warranty. Kindly help.",
               "rating":2.0,
               "usefulness":1.0,
               "title":"Warranty not being registered..., 12 September 2014"
            },
            {
               "body":"Fantastic performance for the price.....Bang for the Buck.I brought this after almost 6 months of research and after going through tons of research and comparisons I finally got this. The Image quality is the same as the D7000 (check DXO mark comparison). The only minus was the lack of 39 AF points unlike the D7000.But it doesn't make much of a difference.The Low ISO noise is exceptional and its Dynamic Range is way above Canon Cameras.I owned a 1100D before and the jump in quality is obvious.Thanks Nikon and Amazon for this exceptional camera at the Perfect Price PointamznJQ.onReady('jQuery', function() {amznJQ.available('popover', function() {var widgetDom = jQuery(\"#R3IJI10K2QDDKZ_imageSection_EA0033FE-E292-11E4-8371-88E6DBD571D3\");var images = widgetDom.find(\".review-image-thumbnail\");for (var c=0;c<images.length;c++) {var imageURL = jQuery(images[c]).attr(\"large-image-url\");jQuery(images[c]).amazonPopoverTrigger({showOnHover:true,literalContent: '<img src=\"'+ imageURL +'\" style=\"max-width:100%;max-height:100%;\">'});}});});",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Beats Every Canon Entry Level Camera, 20 March 2015"
            },
            {
               "body":"My first DSLR from amazon...Superb... The most important thing is that I have successfully registered my cam and lens on the nikon site...One of my friend ordered a cam few months back from Flipkart but the serial number was not registered...Also the amazon india customer care is superb... I personally suggest the readers here that they can buy their electronic items from here and save a lot..  I too saved 7kThank u amazon",
               "rating":5.0,
               "usefulness":1.0,
               "title":"100% genuine n 100% satisfied customer, 21 March 2015"
            },
            {
               "body":"This is one of the best DSLR's from Nikon. When buying entry level DSLR don't ever think about the mega pixels.Because, 5-8 MP are pretty sufficient for beginner's photography and even for those who wont be making big size prints.The photos coming from this camera are pretty sharp. Use a prime lens for getting much better photos than the standard 18-55 lens.The body feels pretty durable.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Nice camera from Nikon., 9 October 2014"
            },
            {
               "body":"I had it with me for few days while travelling to Nainital. Read it's pros and cons down here-Pros-1.Excellent image quality2. Unintimidating interface, but with plenty of manual control3.Articulated, high-res LCD screen4.Sophisticated AF system for the price5.Easy manual selection of off-center AF points6.Unusually fast Live View AF for a low-end DSLR (but still relatively slow compared to mirrorless competitors)7.Effects modes are fun and beginner-friendly8.Much improved continuous shooting performance with Active D-Lighting turned on9.Lots of in-camera raw conversion and post-processing optionsCons-1.Sub-optimal placement of some second-tier controls (like live view switch)2.Movie shooting button 'orphaned' from live view switch3.Buggy Live View / Movie Mode (movies aren't necessarily recorded at set aperture)4.No live histogram in live view5.AF still a little sluggish in live view mode, full-time AF not very effective in live view or movies6.Only direct external ISO control is via slightly inconveniently-placed 'Fn' button7.Auto ISO logic is not well-suited for everyday casual shooting (good for action though)8.Effects modes low on manual control (and customization)9.Will not focus all Nikon lenses (though most popular choices are available)Conclusion-This camera is good for- Effective and easy to use features make the D5100 ideal for everyday photography/demography.This camera not good for- Shooting fast action.",
               "rating":3.0,
               "usefulness":null,
               "title":"Not good for Shooting fast action., 30 December 2014"
            },
            {
               "body":"This is my first dslr and I don't have that much experience in professional photography but I am very much happy with this camera.amznJQ.onReady('jQuery', function() {amznJQ.available('popover', function() {var widgetDom = jQuery(\"#R2B3CLKXL1BKJO_imageSection_EA02F094-E292-11E4-8371-88E6DBD571D3\");var images = widgetDom.find(\".review-image-thumbnail\");for (var c=0;c<images.length;c++) {var imageURL = jQuery(images[c]).attr(\"large-image-url\");jQuery(images[c]).amazonPopoverTrigger({showOnHover:true,literalContent: '<img src=\"'+ imageURL +'\" style=\"max-width:100%;max-height:100%;\">'});}});});",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Happy with this product, 1 March 2015"
            },
            {
               "body":"I ordered Nikon d 5100 model and received camera within very short period at my door step. Thanks amazon for the fast delivery.Nikon d 5100 I ordered is a entry level budget camera which will full fill your all expection. The tutorial CD supplied along with the camera will help those who does not know the operation of a DSLR camera along with users manual supplied.Before ordering camera I did enough research about Nikon and canon economic model and selected Nicon D 5100 model.I am a Nikon fan of DSLR camera but in point and shoot camera Canon score more. I have Canon SX 20 model.I just received this Nikon model and trying to digest it. I think it will satisfy me. I will recommend all Nikon D 5100 buyer should have a prim lenses like Nikon 50 mm f/1.8 af-s model for low light photography as the kit lenses supplied along with the camera is not sufficient. Zoom lenses lover may collect a light weight 50-200 mm f/4-5.6 model also.",
               "rating":4.0,
               "usefulness":null,
               "title":"The best entry level camera for common photography lover., 11 April 2015"
            }
         ],
         "avg_rating":4.6
      },
      "specs":{
         "Item model number":"D5100",
         "Display Resolution Maximum":"1080p Full HD",
         "Battery Cell Composition":"Lithium Ion",
         "Date First Available":"11 April 2014",
         "Flash Modes Description":"Auto",
         "Optical Zoom":"3 X",
         "Product Dimensions":"34.2 x 26.2 x 17.6 cm",
         "img":"http://ecx.images-amazon.com/images/I/41VbNIUApZL._SX300_.jpg",
         "Brand":"Nikon",
         "Video Capture Resolution":"1920x1080",
         "Additional Features":"16.2 Megapixel Camera, 3 inch, Full HD Recording, CMOS Image Sensor",
         "Screen Size":"3 Inches",
         "Viewfinder Type":"Optical",
         "Included Components":"Camera Body, AF-S 18-55mm VR Kit Lens, rechargeable Li-ion battery EN-EL14, battery charger MH-24, audio video cable EG-CP14, USB cable UC-E6, eyepiece Cap DK-5, rubber eyecup DK-20, strap AN-DC3, accessory shoe cover BS-1, body cap BF-1B, viewNX 2 CD, user manual, 8GB card, camera bag",
         "Memory Slots Available":"1",
         "ASIN":"B00JM4V3M4",
         "Batteries Included":"Yes",
         "price":25417.0,
         "Optical Sensor Resolution":"16.2 Megapixels",
         "Connector Type":"usb",
         "Item Weight":"508 g",
         "Continuous Shooting Speed":"4.00",
         "Model":"D5100",
         "Max Shutter Speed":"1/4000 s Seconds",
         "Display Type":"LCD",
         "Number Of Items":"1",
         "Min Shutter Speed":"30 Seconds",
         "Min Focal Length":"18 Millimeters",
         "Image Stabilization":"Digital",
         "Display Technology":"LCD"
      }
   },
   "d800":{
      "url":"http://www.amazon.in/Nikon-25480-NIKON-DSLR-D800/dp/B0076AYNXM",
      "reviews":{
         "reviews":[
            {
               "body":"Nikon D800 is still the best camera to provide the best of Photographs and Videos with its 36 Mega-pixels.Camera battery life is superb and gives more than 800-1000 shots. I have done multiple shoots with this D800 and its still my best. I dont think I would ever need to upgrade from this camera.The Magnesium Alloy body is solid and this makes this camera heavy as well.No oil leaks (as in D600) and no shutter failures till date. I am not using this camera for more than 2 years now.",
               "rating":5.0,
               "usefulness":null,
               "title":"Awesome images and Videos., 10 April 2015"
            }
         ],
         "avg_rating":5.0
      },
      "specs":{
         "price":160850.0,
         "img":"http://ecx.images-amazon.com/images/I/51keaCQQLfL._SL75_.jpg"
      }
   },
   "d750":{
      "url":"http://www.amazon.in/Nikon-D750-Digital-Camera-Black/dp/B00NZ3A5MM",
      "reviews":{
         "reviews":[
            {
               "body":"Guys, please check your local store for this camera instead of buying it online. The price listed here is around INR 130k which is probably a bit higher than what your local dealer will charge you. Plus there is a flare issue with the D750. So its best to check if your body also has this issue in the shop, though its not easy to produce the same light sources required to reproduce the issue. But you can at least find out if its a bad copy. Because the problem is much more amplified if you have a bad copy & you will need a larger focus micro-adjust for every lens because the AF module's alignment is also a bit off.Here is some more information about the issue:http://www.dpreview.com/reviews/nikon-d750/9I wouldn't be too worried, because the issue is minor, and Nikon has issued instructions to service centers to deal with the problem in case you get a bad copy.I would recommend potential buyers to wait it out till the issue has been sorted, or check for a >January 2015 imported camera from your local store if possible to be sure that this issue doesn't affect your camera.This reminds me of the time the D600 was released. The sensor had some issue with dust, so they went ahead and made an entire new camera because of that. I hope they don't go and announce another model because of this minor issue, as it would really disappoint me, and other early adopters. In any case, if some thing like that happens, then the price of the D750 is likely to drop further, to around 110k like the D600, so those who can wait should wait before pulling the trigger on this one.But, if you're here, you already know how good this camera is. I am really happy about this camera, and its price. It beats the Canon 5D mark III in every aspect at almost 60k lesser. How sweet is that? We can get a Tamron 24-70 F2.8 VC for this amount.ATM, I don't think this camera has any competitors at its price point. The AF is super fast, and its high ISO capabilities are just shy of the D4s, which is saying a lot.I like the weather sealing, because you it doesn't have any condensation inside the viewfinder when you go from a chilly room to the outside where its hot and humid. My non-weather sealed cameras would become worthless in such situations, and in the rain when water went inside the viewfinder.Its much lighter than the D4, which is almost double the weight of the D750. On hearing that the D750 has a flippy screen, I was a bit skeptical of its build quality, but it seems that Nikon has done their homework, and it looks pretty reliable. At the very least, I know for sure that I'm not going to be facing the same issues like the swivel screens on the D5xxx series.----------------------D750 vs D800/D810 argument:----------------------I really miss only one thing from the pro cameras from Nikon. Its the 1/8000 shutter speed. The D750 tops out at 1/4000th of a second, and its disappointing, because the D7100 can do 1/8000th of a second at ~60k cheaper. This means that, you always need filters of different sizes for every lens you have in the your bag. This afternoon, I had to stop down to F2.8 while taking portraits so as to not overexpose the scene. I did not have any filters with me, so stopping down was the only way I could get the exposure right.The D810 is much better in this regard. You can shoot at ISO 1/8000th of a second, plus you can also shoot at ISO 64. Which means that you're effectively getting around 1/3rd of a stop less light. So its equal to shooting at ~1/11000th of a second at ISO100. Which means you don't need to stop down to reduce light.The D810 also has a larger buffer, and a faster crop factor shooting frame rate 7fps vs 6.5fps of the D750. Its also better built than the D750. Another thing is that its AF point spread covers more of the frame[which is good for tracking** if you're into sports and that sort of thing]. But the price is much higher too, by about 50-60k for which you can set up your own studio.**Note that though the AF module, though it has a smaller spread than the D810 & D4s, it is actually a bit more sensitive than the D810/D4s, ie it can shoot in 1-2 stops lower light than the most expensive Fx camera from Nikon!Anyways, for the average user 99% of the shots aren't going to be wide aperture portraits in the sun, so you can go for the D750 without any worries. Plus if you think about it, until the D3x/D4, Fx cameras could only go till ISO 200, so what it means is that when you're shooting at ISO 100 at 1/4000th of a second, you're effectively shooting with an exposure value similar to the D3/D3s at ISO 200 and 1/8000th of a second.YOU DON'T NEED 36MP, it only means that you'd be compromising on high ISO shots. The D750 can produce cleaner colors 1 stop better than the D810. The D810 can compensate for noise and detail by oversampling, but it loses color accuracy. Once you lose color accuracy, in skin tones and other colors, you will never get them back unless you spend a ridiculous amount of time in post. This is one of the reasons why the shots out of the D4 and D4s look so much different when compared to other cameras. You'll notice this especially in skin tones when shooting at ISO 6400 and above. So stay away from the D810, and buy the D750. You will not regret it. Its one step closer to the D4s than the D810.---------------------------The D750 vs D7100 argument:---------------------------Now you're tight on budget, you can consider this combo:D7100 + Sigma 18-35mm F1.8 for the same price.Its perfectly fine, the lack of an AA filter in the D7100 gives it the edge in detail, and if you use it with the Sigma, its going to be sharper than the D750 on any FF standard Zoom!!But there are some issues, like the lack of standard focal length lenses, where every lens behaves slightly differently on APS-C bodies. For example, try this: The 24-70mm F2.8 is ~3x zoom, which is like a standard focal length which we normally use, but the 18-35 becomes a 27-52.5mm lens, which isn't that wide, nor does it go close enough. I am kinda hard pressed to recommend it at the same price as that of the Tamron 24-70 F2.8 VC, which is weather sealed, and has a bit more reach. Same is the case with every other lens. Take another example, the 50mm which is a standard lens becomes a portrait lens on the D7100 ie, its equivalent focal length becomes 75mm which is a bit shorter than a 85mm which is usually what people consider as a portrait focal length. So its a bit confusing, you're not sure you really want that focal length in APS-C. Whereas FF is usually a standard affair.But if you're on a budget, I can understand why people might consider this. In fact, its a totally valid option, considering the prices of the lenses in Nikon's FF lens lineup. Most of them are ridiculously priced. Its good that companies like Sigma and Tamron are making use of this market opportunity.-------------------Overall impression:-------------------It was very difficult for me to find any drawbacks in the D750. Overall an excellent camera.-----------------Highly recommend!-----------------",
               "rating":5.0,
               "usefulness":0.8823529411764706,
               "title":"Best all round Full Frame DSLR at around INR 1.2L, 29 January 2015"
            },
            {
               "body":"Nice DSLR",
               "rating":5.0,
               "usefulness":0.25,
               "title":"Five Stars, 18 October 2014"
            }
         ],
         "avg_rating":5.0
      },
      "specs":{
         "Item model number":"D750",
         "Optical Zoom":"1 X",
         "Min Focal Length":"150 Millimeters",
         "img":"http://ecx.images-amazon.com/images/I/41sDLLjaYzL._SX300_.jpg",
         "Batteries Included":"Yes",
         "Batteries Required":"Yes",
         "Brand":"Nikon",
         "Date First Available":"27 September 2014",
         "Max Resolution":"24.30 Megapixels",
         "ASIN":"B00NZ3A5MM",
         "Model":"D750",
         "Screen Size":"7.62 Centimeters",
         "price":123000.0
      }
   },
   "d3000":{
      "url":"http://www.amazon.in/Nikon-D3100-14-2MP-Digital-18-55mm/dp/B00JM4VSWY",
      "reviews":{
         "reviews":[
            {
               "body":"Excellent camera. I'm loving it.The quality of photos are awesome and I prefer capturing images in RAW format which can be edited with Nikon ViewNX software provided with the camera. The RAW format contains full details of the image.Only problem with this camera is movie file. The footage captured is recorded in .mov file which is QuickTime multimedia file format. This file is not recognized by windows movie maker. I've tried a lot on net and downloaded several softwares to convert the file into mp4/avi preferable freewares. mp4 file converted by handbrake is again not recognized by windows movie maker. avi conversion have loss in quality.This is annoying. I could not play the footage in my TV. Nikon should provide a conversion software, else it is costly to convert video files to edit and play. Video quality is just amazing.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"MUST BUY FOR BEGINNERS, 28 October 2014"
            },
            {
               "body":"I  got a good deal on this product from Amazon. I never intended to buy a DSLR but looking at the deal posted on amazon just tempted me to.Had initially planned to buy a small point and shoot camera but then bought this one.Must say I'm quite happy and the product  is good and you can close your eyes and blindly go for it. It's a product for beginners and will ignite your passion in photography!",
               "rating":5.0,
               "usefulness":0.9,
               "title":"No brainer buy!!!, 29 August 2014"
            },
            {
               "body":"I have a Nikon FE2 SLR camera. Since, film type photography has disappeared, this is my digital replacement. Mobile phones or compact digital cameras don't do the job adequately. However, the Nikon D3100 is a compact version of some of the higher end cameras. The buttons and other features are a little tightly placed, due to lack of space on the face of the camera. That is it's only drawback. You get used to it within a few hours. The camera is awesome otherwise in true Nikon tradition! A very good buy for those who want a small DSLR in their hands. Good balance and good holding shape. Maybe a palm strap added to the right side would also be a good idea.",
               "rating":4.0,
               "usefulness":1.0,
               "title":"The camera is awesome otherwise in true Nikon tradition, 18 March 2015"
            },
            {
               "body":"I am a long standing Canon user so wanted to try out a Nikon. I appreciate the prompt service and packaging by Amazon which also gave me a good deal.It is a good camera comparable to Canon in the same price range. The beginner will not go wrong getting it or a Canon in the same price range. The Amazon packaging and delivery are outstanding, the best of any on-line sale and delivery company.I feel that Nikon autofocus and movie are not nearly as good as with Canon, especially for outdoor work, but it could be my bias. The images and color leave nothing to be desired. All told good value for money.",
               "rating":3.0,
               "usefulness":1.0,
               "title":"Recommended for beginners., 2 March 2015"
            },
            {
               "body":"Awesome fast delivery by Amazon...got it next day of orderingI waited for long to buy a DSLR and finally got itIts better than any camera in range...with self cleaning sensors.. And easy to use...I got this camera for Rs.16,800 and now have been using this camera since past four months...I am using it for landscaping and portraits and it works like a charm...The more u will learn on it the more beautiful will be the imagesBetter upgrade ur lenses than ur camera....",
               "rating":5.0,
               "usefulness":null,
               "title":"Awesome camera for best price.., 13 April 2015"
            },
            {
               "body":"My 1st camera.. interesting and good.amznJQ.onReady('jQuery', function() {amznJQ.available('popover', function() {var widgetDom = jQuery(\"#R3KODGS1Y2WJGQ_imageSection_F7236498-E292-11E4-A30E-708C03927AF0\");var images = widgetDom.find(\".review-image-thumbnail\");for (var c=0;c<images.length;c++) {var imageURL = jQuery(images[c]).attr(\"large-image-url\");jQuery(images[c]).amazonPopoverTrigger({showOnHover:true,literalContent: '<img src=\"'+ imageURL +'\" style=\"max-width:100%;max-height:100%;\">'});}});});",
               "rating":4.0,
               "usefulness":1.0,
               "title":"interesting and good., 6 March 2015"
            },
            {
               "body":"Loved the camera. Its my first DSLR and am writing this review after 2 months of using the product. The price, delivery, packing including the product itself  and everything else was perfect. One of the best products for diving into DSLR photography zone",
               "rating":5.0,
               "usefulness":null,
               "title":"Awesome product awesome services, 12 March 2015"
            },
            {
               "body":"Superb product in this price range.... But I am unfortunate to receive a 4GB card inside instead of 8GB. Though it is a small issue, seller should be careful.",
               "rating":5.0,
               "usefulness":null,
               "title":"superb...., 1 November 2014"
            },
            {
               "body":"One of the Best Product from Nikon!! Perfect Choice for novice photographer who want to have a DSLR.Picture quality is just awesome even on auto mode.",
               "rating":5.0,
               "usefulness":null,
               "title":"Awesome Product, 13 February 2015"
            },
            {
               "body":"when i buying i had a question about the quality . but it was better than what i have expexted ..good at good offer ...worth in buying in amazon thank you",
               "rating":5.0,
               "usefulness":null,
               "title":"its good to buy in amazon, 11 March 2015"
            }
         ],
         "avg_rating":4.6
      },
      "specs":{
         "Item model number":"D3100",
         "Display Resolution Maximum":"1080p Full HD",
         "Battery Cell Composition":"Lithium Ion",
         "Date First Available":"11 April 2014",
         "Flash Modes Description":"Auto",
         "Min Aperture":"5.60 f_stop",
         "Optical Zoom":"3 X",
         "Product Dimensions":"33.8 x 25.8 x 17 cm",
         "img":"http://ecx.images-amazon.com/images/I/41doBfUErTL._SY300_.jpg",
         "Brand":"Nikon",
         "Batteries Included":"Yes",
         "Additional Features":"14.2 Megapixel Camera, 3.0 inch LCD, CMOS",
         "Screen Size":"3 Inches",
         "Viewfinder Type":"Optical",
         "Included Components":"Nikon D3100 Camera Body, AF-S 18-55mm VR Kit Lens, Rechargeable Li-ion Battery EN-EL14, Quick Charger MH-24, Rubber Eyecup DK-20, Camera Strap AN-DC3, USB cable, Body Cap BF-1B, Eyepiece Cap DK-5, Accessory Shoe Cover BS-1, 2 Ferrite Core, View NX 2 CD, User Manual, with 8GB Card and Camera Bag.",
         "Memory Slots Available":"1",
         "ASIN":"B00JM4VSWY",
         "Video Capture Resolution":"1920x1080",
         "price":23100.0,
         "Optical Sensor Resolution":"14.2 Megapixels",
         "Connector Type":"usb",
         "Item Weight":"454 g",
         "Continuous Shooting Speed":"3.00",
         "Model":"D3100",
         "Resolution":"14.2 megapixels",
         "Max Shutter Speed":"1/4000 Sec Seconds",
         "Display Type":"LCD",
         "Number Of Items":"1",
         "Min Shutter Speed":"30 Seconds",
         "Min Focal Length":"18 Millimeters",
         "Image Stabilization":"Digital",
         "Display Technology":"LCD"
      }
   },
   "d810":{
      "url":"http://www.amazon.in/Nikon-D810-36-3MP-Digital-Camera/dp/B00LAJQVR6",
      "reviews":{
         "reviews":[
            {
               "body":"it is a great Camera, all reviews of the product will tell you that. However i had a very bad experience with Amazon india. It is fairly expensive thing to buy online...the delivery was late, i had to call 15 times and the support had no clue to where the shipment was..they just read the track information back to you.Moreover it is about 550$ more expensive online than waht you can buy in shop for..thats a cool 35,000 Rs less. with all warranties etc. Great Camera..but buy it at a better place.",
               "rating":5.0,
               "usefulness":0.7142857142857143,
               "title":"Great Camera, Bad delivery, and Expensive at Amazon, 14 August 2014"
            }
         ],
         "avg_rating":5.0
      },
      "specs":{
         "Item model number":"1542",
         "Batteries:":"1 Lithium ion batteries required. (included)",
         "Max Vertical Resolution":"4912 Pixels",
         "Date First Available":"21 July 2014",
         "Has Self Timer":"Yes",
         "Has Image Stabilization":"No",
         "Optical Zoom":"1 X",
         "img":"http://ecx.images-amazon.com/images/I/51keaCQQLfL._SX300_.jpg",
         "Brand":"Nikon",
         "Max Resolution":"36.3",
         "Hardware Interface":"AV",
         "Screen Size":"3.2 Inches",
         "Viewfinder Type":"Optical (tunnel)",
         "Batteries Included":"Yes",
         "Batteries Required":"Yes",
         "price":180600.0,
         "Optical Sensor Resolution":"36.3 Megapixels",
         "Item Weight":"980 g",
         "Continuous Shooting Speed":"5",
         "Has Auto Focus":"Yes",
         "Model":"1542",
         "Resolution":"36.3 megapixels",
         "Min Focal Length":"28 Millimeters",
         "Has Audio Recording":"Yes",
         "Max Shutter Speed":"1/8000 Seconds",
         "Min Shutter Speed":"30 seconds",
         "ASIN":"B00LAJQVR6",
         "Digital Zoom":"46 X",
         "Model Year":"2014",
         "Product Dimensions":"14.6 x 8.2 x 12.3 cm"
      }
   },
   "d3100":{
      "url":"http://www.amazon.in/Nikon-D3100-14-2MP-Digital-18-55mm/dp/B00JM4VSWY",
      "reviews":{
         "reviews":[
            {
               "body":"Excellent camera. I'm loving it.The quality of photos are awesome and I prefer capturing images in RAW format which can be edited with Nikon ViewNX software provided with the camera. The RAW format contains full details of the image.Only problem with this camera is movie file. The footage captured is recorded in .mov file which is QuickTime multimedia file format. This file is not recognized by windows movie maker. I've tried a lot on net and downloaded several softwares to convert the file into mp4/avi preferable freewares. mp4 file converted by handbrake is again not recognized by windows movie maker. avi conversion have loss in quality.This is annoying. I could not play the footage in my TV. Nikon should provide a conversion software, else it is costly to convert video files to edit and play. Video quality is just amazing.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"MUST BUY FOR BEGINNERS, 28 October 2014"
            },
            {
               "body":"I  got a good deal on this product from Amazon. I never intended to buy a DSLR but looking at the deal posted on amazon just tempted me to.Had initially planned to buy a small point and shoot camera but then bought this one.Must say I'm quite happy and the product  is good and you can close your eyes and blindly go for it. It's a product for beginners and will ignite your passion in photography!",
               "rating":5.0,
               "usefulness":0.9,
               "title":"No brainer buy!!!, 29 August 2014"
            },
            {
               "body":"I have a Nikon FE2 SLR camera. Since, film type photography has disappeared, this is my digital replacement. Mobile phones or compact digital cameras don't do the job adequately. However, the Nikon D3100 is a compact version of some of the higher end cameras. The buttons and other features are a little tightly placed, due to lack of space on the face of the camera. That is it's only drawback. You get used to it within a few hours. The camera is awesome otherwise in true Nikon tradition! A very good buy for those who want a small DSLR in their hands. Good balance and good holding shape. Maybe a palm strap added to the right side would also be a good idea.",
               "rating":4.0,
               "usefulness":1.0,
               "title":"The camera is awesome otherwise in true Nikon tradition, 18 March 2015"
            },
            {
               "body":"I am a long standing Canon user so wanted to try out a Nikon. I appreciate the prompt service and packaging by Amazon which also gave me a good deal.It is a good camera comparable to Canon in the same price range. The beginner will not go wrong getting it or a Canon in the same price range. The Amazon packaging and delivery are outstanding, the best of any on-line sale and delivery company.I feel that Nikon autofocus and movie are not nearly as good as with Canon, especially for outdoor work, but it could be my bias. The images and color leave nothing to be desired. All told good value for money.",
               "rating":3.0,
               "usefulness":1.0,
               "title":"Recommended for beginners., 2 March 2015"
            },
            {
               "body":"Awesome fast delivery by Amazon...got it next day of orderingI waited for long to buy a DSLR and finally got itIts better than any camera in range...with self cleaning sensors.. And easy to use...I got this camera for Rs.16,800 and now have been using this camera since past four months...I am using it for landscaping and portraits and it works like a charm...The more u will learn on it the more beautiful will be the imagesBetter upgrade ur lenses than ur camera....",
               "rating":5.0,
               "usefulness":null,
               "title":"Awesome camera for best price.., 13 April 2015"
            },
            {
               "body":"My 1st camera.. interesting and good.amznJQ.onReady('jQuery', function() {amznJQ.available('popover', function() {var widgetDom = jQuery(\"#R3KODGS1Y2WJGQ_imageSection_F45BC002-E292-11E4-BA6E-F9408462F410\");var images = widgetDom.find(\".review-image-thumbnail\");for (var c=0;c<images.length;c++) {var imageURL = jQuery(images[c]).attr(\"large-image-url\");jQuery(images[c]).amazonPopoverTrigger({showOnHover:true,literalContent: '<img src=\"'+ imageURL +'\" style=\"max-width:100%;max-height:100%;\">'});}});});",
               "rating":4.0,
               "usefulness":1.0,
               "title":"interesting and good., 6 March 2015"
            },
            {
               "body":"Loved the camera. Its my first DSLR and am writing this review after 2 months of using the product. The price, delivery, packing including the product itself  and everything else was perfect. One of the best products for diving into DSLR photography zone",
               "rating":5.0,
               "usefulness":null,
               "title":"Awesome product awesome services, 12 March 2015"
            },
            {
               "body":"Superb product in this price range.... But I am unfortunate to receive a 4GB card inside instead of 8GB. Though it is a small issue, seller should be careful.",
               "rating":5.0,
               "usefulness":null,
               "title":"superb...., 1 November 2014"
            },
            {
               "body":"One of the Best Product from Nikon!! Perfect Choice for novice photographer who want to have a DSLR.Picture quality is just awesome even on auto mode.",
               "rating":5.0,
               "usefulness":null,
               "title":"Awesome Product, 13 February 2015"
            },
            {
               "body":"when i buying i had a question about the quality . but it was better than what i have expexted ..good at good offer ...worth in buying in amazon thank you",
               "rating":5.0,
               "usefulness":null,
               "title":"its good to buy in amazon, 11 March 2015"
            }
         ],
         "avg_rating":4.6
      },
      "specs":{
         "Item model number":"D3100",
         "Display Resolution Maximum":"1080p Full HD",
         "Battery Cell Composition":"Lithium Ion",
         "Date First Available":"11 April 2014",
         "Flash Modes Description":"Auto",
         "Min Aperture":"5.60 f_stop",
         "Optical Zoom":"3 X",
         "Product Dimensions":"33.8 x 25.8 x 17 cm",
         "img":"http://ecx.images-amazon.com/images/I/41doBfUErTL._SY300_.jpg",
         "Brand":"Nikon",
         "Batteries Included":"Yes",
         "Additional Features":"14.2 Megapixel Camera, 3.0 inch LCD, CMOS",
         "Screen Size":"3 Inches",
         "Viewfinder Type":"Optical",
         "Included Components":"Nikon D3100 Camera Body, AF-S 18-55mm VR Kit Lens, Rechargeable Li-ion Battery EN-EL14, Quick Charger MH-24, Rubber Eyecup DK-20, Camera Strap AN-DC3, USB cable, Body Cap BF-1B, Eyepiece Cap DK-5, Accessory Shoe Cover BS-1, 2 Ferrite Core, View NX 2 CD, User Manual, with 8GB Card and Camera Bag.",
         "Memory Slots Available":"1",
         "ASIN":"B00JM4VSWY",
         "Video Capture Resolution":"1920x1080",
         "price":23100.0,
         "Optical Sensor Resolution":"14.2 Megapixels",
         "Connector Type":"usb",
         "Item Weight":"454 g",
         "Continuous Shooting Speed":"3.00",
         "Model":"D3100",
         "Resolution":"14.2 megapixels",
         "Max Shutter Speed":"1/4000 Sec Seconds",
         "Display Type":"LCD",
         "Number Of Items":"1",
         "Min Shutter Speed":"30 Seconds",
         "Min Focal Length":"18 Millimeters",
         "Image Stabilization":"Digital",
         "Display Technology":"LCD"
      }
   },
   "d4s":{
      "url":"http://www.amazon.in/Nikon-D4-Body-DSLR-Camera/dp/B00813MPCY",
      "reviews":{
         "reviews":[
            {
               "body":"This is the best camera in the work, I have kept my house as a collateral and brought this Camera. trust me guys its really worth it",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Out of this world :) Price, 2 February 2015"
            }
         ],
         "avg_rating":5.0
      },
      "specs":{
         "Item model number":"D4 DSLR",
         "Display Resolution Maximum":"1080p Full HD",
         "Battery Cell Composition":"Lithium Ion",
         "Memory Storage Capacity":"16 GB",
         "Date First Available":"7 May 2012",
         "Flash Modes Description":"Auto",
         "Optical Zoom":"5 X",
         "Product Dimensions":"16 x 9 x 15.6 cm",
         "img":"http://ecx.images-amazon.com/images/I/51ABbmZg2iL._SX300_.jpg",
         "Brand":"Nikon",
         "Batteries Included":"Yes",
         "Max Resolution":"16.20 Megapixels",
         "Additional Features":"16.2Mp, 3.2\" LCD, 36.0 x 23.9mm CMOS Sensor, 2 years Nikon India warranty",
         "Screen Size":"3.20 Inches",
         "Viewfinder Type":"Optical",
         "Included Components":"Nikon D4 Digital SLR Body, BF-1B Body Cap, BS-2 Accessory Shoe Cover, EN-EL18 Rechargeable Li-ion Battery with Terminal Cover, MH-26 Battery Charger with Power Cable and two Contact Protectors, UC-E15 USB Cable, USB Cable Clip, UF-2 Mic Stereo input jack for ME-1 Stereo Microphone, AN-DC7 Strap, ViewNX 2 installer CD",
         "Memory Slots Available":"1",
         "ASIN":"B00813MPCY",
         "Video Capture Resolution":"1920x1080",
         "Batteries Required":"No",
         "price":356024.0,
         "Optical Sensor Resolution":"16.2 Megapixels",
         "Connector Type":"usb",
         "Item Weight":"1.2 Kg",
         "Continuous Shooting Speed":"10.00",
         "Model":"D4 DSLR",
         "Max Shutter Speed":"1/8000 s Seconds",
         "Display Type":"LCD",
         "Includes AC Adapter":"No",
         "Number Of Items":"1",
         "Min Shutter Speed":"30 Seconds",
         "Min Focal Length":"1.50 Millimeters",
         "Image Stabilization":"Optical",
         "Digital Zoom":"4 X",
         "Display Technology":"LCD"
      }
   },
   "d4":{
      "url":"http://www.amazon.in/Nikon-D4-Body-DSLR-Camera/dp/B00813MPCY",
      "reviews":{
         "reviews":[
            {
               "body":"This is the best camera in the work, I have kept my house as a collateral and brought this Camera. trust me guys its really worth it",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Out of this world :) Price, 2 February 2015"
            }
         ],
         "avg_rating":5.0
      },
      "specs":{
         "Item model number":"D4 DSLR",
         "Display Resolution Maximum":"1080p Full HD",
         "Battery Cell Composition":"Lithium Ion",
         "Memory Storage Capacity":"16 GB",
         "Date First Available":"7 May 2012",
         "Flash Modes Description":"Auto",
         "Optical Zoom":"5 X",
         "Product Dimensions":"16 x 9 x 15.6 cm",
         "img":"http://ecx.images-amazon.com/images/I/51ABbmZg2iL._SX300_.jpg",
         "Brand":"Nikon",
         "Batteries Included":"Yes",
         "Max Resolution":"16.20 Megapixels",
         "Additional Features":"16.2Mp, 3.2\" LCD, 36.0 x 23.9mm CMOS Sensor, 2 years Nikon India warranty",
         "Screen Size":"3.20 Inches",
         "Viewfinder Type":"Optical",
         "Included Components":"Nikon D4 Digital SLR Body, BF-1B Body Cap, BS-2 Accessory Shoe Cover, EN-EL18 Rechargeable Li-ion Battery with Terminal Cover, MH-26 Battery Charger with Power Cable and two Contact Protectors, UC-E15 USB Cable, USB Cable Clip, UF-2 Mic Stereo input jack for ME-1 Stereo Microphone, AN-DC7 Strap, ViewNX 2 installer CD",
         "Memory Slots Available":"1",
         "ASIN":"B00813MPCY",
         "Video Capture Resolution":"1920x1080",
         "Batteries Required":"No",
         "price":356024.0,
         "Optical Sensor Resolution":"16.2 Megapixels",
         "Connector Type":"usb",
         "Item Weight":"1.2 Kg",
         "Continuous Shooting Speed":"10.00",
         "Model":"D4 DSLR",
         "Max Shutter Speed":"1/8000 s Seconds",
         "Display Type":"LCD",
         "Includes AC Adapter":"No",
         "Number Of Items":"1",
         "Min Shutter Speed":"30 Seconds",
         "Min Focal Length":"1.50 Millimeters",
         "Image Stabilization":"Optical",
         "Digital Zoom":"4 X",
         "Display Technology":"LCD"
      }
   },
   "d3300":{
      "url":"http://www.amazon.in/Nikon-D3300-Digital-Camera-18-55mm/dp/B00JM4WAPS",
      "reviews":{
         "reviews":[
            {
               "body":"D3300 takes beautiful images. I just can't seem to take my hands off it. Now it might be because its pretty new to me, but the images it takes are really beautiful. I would suggest for the person who's buying it, that the kit lens is really good. You would definitely want to buy a 35mm f/1.8 lens(Since its a DX camera its better to go for 35 instead of 50mm) for the Bokeh effect to take great images of objects up close or portraits because the kit lens is not really great at producing bokeh because of the aperture limitations. Bokeh is the effect which makes the background appear blurred out. As an Indian, and if you're someone who's bought an entry level DSLR like this one, definitely go for the other lens for the portraits it will make a huge difference in the photographs you'll take.What the kit lens will do for you, however, is take great images. Honestly 18-55 is rock solid stuff. This lens is really really good and its a steal if you go for the kit lens+body.The video quality is through the roof. For the price I've paid I'm really really satisfied with my camera.Good luck shooting!PS: I'm tagging some photos that I personally took in the last 2 days after I received this camera. These are all in JPEG format.This is the absolute best camera in this price range. Don't think twice about this, just go for it. :)amznJQ.onReady('jQuery', function() {amznJQ.available('popover', function() {var widgetDom = jQuery(\"#R1WGAZ8GK3FRUD_imageSection_ED2EB384-E292-11E4-AF33-9D91F0501C51\");var images = widgetDom.find(\".review-image-thumbnail\");for (var c=0;c<images.length;c++) {var imageURL = jQuery(images[c]).attr(\"large-image-url\");jQuery(images[c]).amazonPopoverTrigger({showOnHover:true,literalContent: '<img src=\"'+ imageURL +'\" style=\"max-width:100%;max-height:100%;\">'});}});});",
               "rating":5.0,
               "usefulness":1.0,
               "title":"This camera is amazing., 1 December 2014"
            },
            {
               "body":"General Observations about Amazon, packaging & warrantyProduct ordered on 15th Oct --- Delivered on 29th Oct....!!!Packaging was very good.No dealer stamp on warranty and Bill doesnt contain product number which may be a problem for warranty, have to clarify with amazon regarding this, Before purchase i asked them about warranty and they have assured if u buy from Amazon fulfilled supplier amazon will give warranty even if nikon does not gives thats when i decided to buy online since it was 6k cheaper than authorized dealers which will save u money to buy an extra lens!!!Now about the Nikon masterpiece D3300Before buying any expensive product online it is mandatory for us all to do a research about the competetion and available products within our budget. Please compare the available products in ur price range only like u can not compare D3300 with a DSLR costing 55K...It will come down to Canon 1200D with zoom lens kit, D3200, D5200 and Canon 600D.All between 26-32k range. Nikon D3100 & Canon 1100D etc are old models and are still cheaper so i didnt considered them.Being a first DSLR hands down almost 99% of google recommemds D3300. I went to Nikon and Canon dealers and checked all models in this budget. heres why i went for D3300 & the after experience :1) It offers u latest processor and sensor with VR-II kit lens.2) The Battery Life is Best in its class with remarkable nos ahead from the competetion and i felt the same after using it.3) Its really very handy and small compared to D5200, only thing 5200 has a tilt screen but i felt it will not make that much difference, for fitting a tilt screen the size of the camera becomes large. I read a lot since my final two models were 5200 and 3300 and felt that the latest processor and better battery life and a diff of 6k for D3300 will be good for my requirements. Since nowhere u can find exceptional difference between image quality of the two cameras. HDR u will hardly require and tilt screen for me was not a priority.4) The image quality is superb. it has a child mode which is very useful when u dont have time for manual settings. Auto mode produces fine images when u dont have time for settings.5) Comes with 8GB card which will be sufficient for few months till u conquer all skills of photography.6) Bag is ok but not very stylish. Can accomodate an extra lens easily.7) Camera is very very fast, first time users will fall in love with the speed of the camera absolutely no lags anywhere.8) Photograps in low light and indoor pics at evening or night time are also very impressive. Flash does an excellent job.9) Colour reproduction is superb, if u click vegetables and look on HDTV they look way better than they look in real life :)...10) I was not used to click pics through view finder so i thought live view is a very useful feature for a DSLR but in real life u will  hardly use live view once u get ur hands on unless a position where u cant put ur head below the cam, even with specks it is  very easy to shoot using view finder .11) LCD screen is very good. With high resolution screen u can judge the quality of image immediatly after clicking which is difficult if  the LCD resolution is low.12) Nikon website is very informative and helps a lot u can register for nikon school and refer tutorials.13) Canon 1200D with Kit lens & zoom lens is a very tough competetion since Nikon D3300 with similar zoom lens is 10K more but  after a lot of reading from websites and reviews u will find that for image quality nikon is a clear winner at entry level DSLR by a  far margin. Kit lens will fulfil most of ur photography requirements initially, wait till u discover urself what lens u really require  before going on to purchase the combo pack with zoom lens.  Hence i decided to buy D3300 and leave the zoom lens in to be bought further category.14) It takes a little time for autofocus at night in very low light but it is ok otherwise autofocus in all other conditions is excellent.  captures fast moving objects in the frame perfectly.15) Manual supplied in the box is useful, and should be read first if u r using a DSLR for the first time.16) It has a wifi feature which may b useful for clicking pics using ur smart phone but requires u to purchase a dongle.It feels excellent to click from this cam because of its fine ergonomics, small size and light weight. its a worth investment. Its a long road in learning and mastering the techniques in photography, with nikon u will enjoy learing it coz when u do it right it delivers excellent results.... just remember a quote which i like very much :\"\"\" Buying a Nikon doesnt makes u a photographer... it only makes u the owner of the Nikon Camera...\"\"\"So keep learning....",
               "rating":5.0,
               "usefulness":0.9565217391304348,
               "title":"Best entry level DSLR in the 30K range...., 7 November 2014"
            },
            {
               "body":"Got  this  cam  as  new year  gift  on  dec 30  and  i'm  sharing  my  views  on  this  camPROS :Easy  modes  of  operation  for  beginners  like P A S M ( Program Auto, Aperture, Shutter, Manual ) and Guide mode for dummies.Fixed 3.0\" 921k-dot LCD  which  makes  display  more efficient yet small dispaly .Full HD video  mode  shoots  lovely  and  you'll  love  it.Best  for  Short film making.High ISO Performance  and  noise  occurs  only  at  very  high  level so it's  not  big  deal.5 fps continuous shooting rate helps in sports and wildlife photography.Ideal  cam  for  LOW LIGHT PHOTOGRAPHY  with kit lens 18-55mm.Boekh effect  and DOF can be  easily  achieved with  kit  lens  and  auto focus  is  great  and  very less  noise in lens operation.Optical View Finder results  in  dynamic image when you  view  through it  and  you can adjust  for your requirement.WiFi  Compatible  with WU-1a adapter and  Battery capacity  is  damn  good  one  can't complain (600 shots/full battery My usage).Picture Control  it  has  13 In Build Special Effects  and PANORAMA can be achieved easily.24 Megapixel takes very high resolution image with Expeed 4 Processor.CONS:No Image stabilizationNoise  in high ISO ( above 10000)No  built in WiFi and FLASH will get  heat  if  you  keep on using which results  in consumption of more battery.Auto focus is  not  great  when  you  take  video.VERDICT:Value  for  money  and  you  can  do  lot  of  things  with  this  baby. Many  people  who  don't  know  depth of photography  will suggest  many  people to  go  for  additional  lenses  like  50mm,35mm,70-300,55-200etc... but  the  true  face  is  one  can  do  everything  with  this  kit lens  like ( Portrait,Boekh,Landscape,Low light etc..) Unleash  your  18-55 to  full extend  and  enjoy  it.If  you're  looking  for  bird photography and sports  then  you  will  need  additional Telephoto lens or Zoom lens.Make  sure  you  got  UV filter while  buying  this  cam  cz it  will  protect  your  lens.I  WILL  HIGHLY  RECOMMEND  THIS  CAM  TO  BEGINNERS AND MID LEVEL EXPERTSExperience in amazon:Got  delivered  on  second day  and  it  was  packed  awesome  and  fully  sealed  and latest manufactured product ( Nov 2014). Got  two  years  warranty  from  nikon for  lens  and  cam.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Excellent Camera For Beginers  And Enthusiast, 31 January 2015"
            },
            {
               "body":"This item is very well packed by amazon shipping. overall item appears new and in sealed pack. But after checking in detail I found some grease /oil/ dust on Lens mirror, that also appears on viewfinder. As a newbie i didn't take any risk to clean it by myself. And this also something I was not expecting from a NEW Camera. So 4/5 star.Took some test images and videos, which came out good. After playing with for a week, here are the things would like to recommend to new buyers to considerRecommendation :18-55mm lens kit is something you need to upgrade instantly (you will notice its limitation just in a week after taking some shots). Must have 50mm prime lens and 18-104mm lens (under 20K budget).Also upgrade to 32GB Class10 SD card. For any HD /RAW files 8GB is very limited. For 8GB you can take max 260 RAW only Images or 30-40 min Video @ 1080 60FPS.Also have Nikon Remote Shutter , which you can get under 200 bucks. Not necessary to go for Branded one.Go for D5300 over D3300 Why?I found that D5300 support HDR and Timer (Time-laps settings) and it has 39 focus pt. All these 3 features really matters to explore some more creativity. Also Fold-able LCD does helps at many case, mostly When you are Recording Videos.Adobe Lightroom 5 supports Nikon DSLR tethering only upto D5XXX series. It doesn't support for D3XXX series. Which is important, because I am more into Product Photography. So Live view helps a lot to get better images, also save time for post processing work.Wifi n GPS does sounds good, but remember theses two are also power hungry. But it also give you some additional feature to control with your Smartphone. If you are a traveler-blogger, Wifi-GPS can give you good experience.So spending on a D5300 body only with 15000 bucks can give you more reliable DSLR camera, that you can use for 2-3 years. I am going to upgrade to D5300 or D5500 in next 2-3 months, So I could have easily save 30 grand , if some mention theses things earlier.-Chinmay",
               "rating":4.0,
               "usefulness":1.0,
               "title":"Go For Nikon D5300 body only over D3300., 27 February 2015"
            },
            {
               "body":"I got this one during Diwali Sale for 26.5K Rs, it was a steal deal :)Though I have just started learning photography and handling DSLR, this camera is fantastic. Anyone looking for D5300 but having tight budget can definitely go for this!Got Camera, kit lense18-55mm, battery charger, 8GB san disk card, Nikon camera bag along with warranty cards.Registered the Camera and lens for warranty on NIKON India site.Adding some snaps taken with this Camera :)Happy Clicking!amznJQ.onReady('jQuery', function() {amznJQ.available('popover', function() {var widgetDom = jQuery(\"#R19UU4OL078DCU_imageSection_ED321BE6-E292-11E4-AF33-9D91F0501C51\");var images = widgetDom.find(\".review-image-thumbnail\");for (var c=0;c<images.length;c++) {var imageURL = jQuery(images[c]).attr(\"large-image-url\");jQuery(images[c]).amazonPopoverTrigger({showOnHover:true,literalContent: '<img src=\"'+ imageURL +'\" style=\"max-width:100%;max-height:100%;\">'});}});});",
               "rating":4.0,
               "usefulness":1.0,
               "title":"Just go for it :) You wont regret!, 10 December 2014"
            },
            {
               "body":"This DSLR is excellent. In short, I would recommend it, especially for DSLR beginners or DSLR users who want to carry a very handy and capable DSLR around with them.Things I like:+ Big censor with very good flash-shutter and mirror-shutter sync+ High resolved detail+ Unbelievable low-light performance+ Easy to handle and carry+ Very very ease to use+ Excellent battery life+ Excellent dynamic range+ NIKKOR lenses have excellent silent autofocus, vibration reduction and almost zero chromatic aberrations+ Amazing performance (starts shooting as soon as you turn it on, high burst rate, very fast saving/retrieving and fast handling of files in preview mode+ Acceptably fast autofocus in LiveView mode+ The absence of Optical Low-pass filter really produces some very crisp details+ Shooting videos is an absolute peachThings I don't like:- A bit on the expensive side- Collapsible lens seems like a gimmick- Even with the silent autofocus, the ring motor sound is quite obvious while video recording- Built quality could have been better, especially for a DSLR that's more expensive than others in the same class- I felt that there should have been another Function key- The monitor fails to impress in the very brightest of the days- The memory card given in the kit should have been fasterThese are the things I remember off the top of the head. I'll edit this review if I find something worth adding or changing. Do keep in mind that the good things about this camera far far outweigh the bad ones, which is why I choose to give 5 stars.Great stuff Nikon! Thanks Amazon for a competitive price.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Everyone should own a DSLR and this is where you begin, 25 March 2015"
            },
            {
               "body":"After a lot of research as usual, decided that Nikon India is sheepishly hiding a clearly better product by advertising D5300 and not even mentioning pretty efficiently speced and a bargainishly priced D3300 in their paper advertisements.Except a detachable LCD, wifi and a few more points in Auto focus,I couldn't find any table tilting difference between D3300 and D5300. The sensor is the same, the mega pixel count is the same. Heck D3300 doesn't even have a light filter making each pixel square accept more light. This is advanced DSLR category!I got it at a fantastic price on Amazon. Opted for next day delivery. No probs at all.Went to a 40 day trip to Canada, captured more than 7000 pictures. The images are crisp, color tones perfect, out of the box 'Auto Mode' captures pretty decent (at times even better than manual!) images. Low light performance is also acceptable. Though one needs a bit more practice at low shttee speeds and without a tripod. If you plan to explore night life with this serious camera, you'd definately need a tripod. Otherwise no complains at all. Already feel like I have got my investment's return!I also captured tons of Full HD videos. God the only thing I missed is the image stabilization coz on a 42\" 3D tv the lack of motion soothing is heavily missed. Yet when you know what you're doing, D3300 takes mind boggling videos!The lens along with the kit is the ED VR 18-55 mm Nikkor lens. It does the job perfectly for your day to day photography. But I am just so sure looking at the specs that the D3300 has tons more to offer so planing to by a Prime lens and also a zoom/macro lens in the near future.The party has only just started!",
               "rating":5.0,
               "usefulness":0.8571428571428571,
               "title":"Absolutely the best mid level (not entry level) camera!, 16 October 2014"
            },
            {
               "body":"for the bundle 3/5got my camera today and packing and all were great. I would have rated it a 5 on 5 except for some issues-1) when i had ordered the camera it was listed at 28400 or thereabouts. I got the product for 28990. since I have been waiting quite sometime, and the price currently is this, i had no choice but to buy.This means the price you see on ordering may not remain the same as the price you get in delivery which is rather strange.2) the kit clearly says 8 gb card included. the box and all were completely sealed ( i checked them myself) but the memory card is just not there.any help will be sincerely appreciated.for the camera 5/5 (i could give a 6/5 :P)the best camera you could buy for the money. definitely better than the d5200. apart from the extra 1 point dynamic range, it is the same thing as far as sensor and all go. plus you get all the advanced features of the d5200 the most time saving one being the automatic distortion control. just download the latest firmware and it will take in any lens you could possibly put on it.advise is add a uvc filter and invest in a lens hood.the automatic hdr on 5200 is crap. if you really are into HDR photography you will have to take multiple shots and merge them on your computer to get proper effects.same goes for landscape (which the d3300 has and d5200 does not).plus the 3300 takes 700 plus hots compared to the 5200 which takes 500 odd shots (and yes i have used both).if you cant afford a leica, or if you are cagey about buying the fuji x, this is the smallest, lightest camera with no oplf filter (sharper images) that you can buy India for under 30000 for street photography. Pair it up with a 35mm 1.8 nikon for more light control. 5fps shooting is more than enough unless you are doing very serious sports photography.",
               "rating":3.0,
               "usefulness":1.0,
               "title":"... got my camera today and packing and all were great. I would have rated it a 5 on ..., 22 January 2015"
            },
            {
               "body":"First of all I'd just like to inform, that I'm not a 'DSLR man' :P..... I bought this cam few days back from amazon because it came as a deal here and sold pretty cheap comparing to the other sites. Before buying the cam I've researched about DSLR and what would be the best fit on my pocket over the net and according to many sites and experts NIKON D3300 is the new best in the league of entry level DSLRs. I'm not going to the pro's and con's because first of all, I'm not a specialist on this field and secondly, there are lots of youtube videos and sites about this cam review and I guess they know far better than me.Only a few things what I've noticed in this short period of usage are :i. Good color depth and stunning picsii. Easy to useiii. Lighter than the other sibling and rival DSLRs of this rangeiv. Comes with additional features and modesv. The other accessories provided with the cam are pretty handy [Except the charger. I still can't understand why the charger comes into two attachable pieces. It will be easier to use if it comes as one body]Apart from these I've heard about a issue regarding the genuine product, dealer stamp on the warranty papers etc. Well, I've got the warranty papers but there are no dealer stamps. I don't know if it will become a big issue while claiming the warranty or not. But I took that risk and the product is actually a genuine one. What I've got is the bill paper from the seller i.e amazon and I guess that will be enough to claim the warranty along with the genuine warranty papers and numbers [ You can verify the number written on the warranty paper by matching it with the number written on the lens ].Just wanna say, great job amazon. It would cost me more if I bought this cam from outlets of Nikon or other sites. But amazon gave me a good deal.I got it at around 26.5K with a lens and at 24% discount. So, go for it if you have <= that price. Even if not, you can spend around 28-29K with eyes closed. Just go for it.",
               "rating":4.0,
               "usefulness":1.0,
               "title":"Ni-con D3300 with No-cons, 30 October 2014"
            },
            {
               "body":"This is a great camera. Crisp and sharp pictures.I got it for about 7K discount from Amazon but was very disheartened upon switching the camera On. It didn't turn on. Tried  multiple times but it didn't work. Charged the battery and everything. Returned it next day.Bought it for 30K from a Nikon india local shop. Checked it and then took it. Worked like a charm. It maybe one of those exceptional case for me when it didn't work. But it definitely has left a bad taste in my mouth.I couldn't believe that the product was delivered the next day to me. Amazing.When i ordered a refund, he picked up next day, No questions asked ( i filled the reason online while requesting the return though). That maybe because i live in NCR.Amazon's service is great!",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Great Camera!, 18 November 2014"
            }
         ],
         "avg_rating":4.6
      },
      "specs":{
         "Item model number":"D3300",
         "Optical Zoom":"3 X",
         "img":"http://ecx.images-amazon.com/images/I/41og%2B-WZh6L._SX300_.jpg",
         "ASIN":"B00JM4WAPS",
         "Screen Size":"3 Inches",
         "Brand":"Nikon",
         "Date First Available":"11 April 2014",
         "Optical Sensor Resolution":"24.2 Megapixels",
         "Item Weight":"2 Kg",
         "Model":"D3300",
         "price":28490.0,
         "Resolution":"24.2 megapixels",
         "Product Dimensions":"31.8 x 25.2 x 20.2 cm",
         "Included Components":"Nikon D3300  Digital SLR Body, EN-EL14a rechargeable Li-ion battery (with terminal cover), MH-24 battery charger, AN-DC3 strap, UC-E17 USB cable, EG-CP14 audio/video cable, ViewNX 2 CD-ROM, User Manual, Warranty Card,  8GB SD Card and Camera Bag, 18-55mm Lens."
      }
   },
   "d5300":{
      "url":"http://www.amazon.in/Nikon-24-1MP-Digital-Camera-18-55mm/dp/B00JM4VE0A",
      "reviews":{
         "reviews":[
            {
               "body":"ProsExcellent image qualityHigh resolution sensor produces highly detailed imagesUseful and sophisticated Auto ISO systemSolid feature set for first-time DSLR usersGood frame coverage of 39-point AF array1080/60p HD maximum video resolutionCustomizable Fn buttonFully articulated LCDReliable built-in Wi-Fi and location taggingThe D5300 presents D7100-level image quality in a camera body that's somewhere around $400 cheaper. It produces good quality, highly detailed JPEGs and those who are so inclined will find lots of latitude for adjusting Raw files. Like its predecessor, the D5300's Raw files allow shadows to be opened up without introducing too much in the way of noise. Default JPEG rendering is also pleasant, without any over-sharpening halo artifacts.The D5300's video quality is just as notable as its still image quality. It offers full 1080/60p resolution, available without the crop mode that the D7100 applies to its highest resolution videos. As a result the D5300's video is more detailed and motion is smooth. With the ability to output Raw video over HDMI and plug in an external microphone, the D5300 is well worth consideration as a beginning videographer's camera or a cheap secondary camera for a pro.The bottom line is that you can't argue with 24 megapixels of AA-filter-less resolution. The D5300 delivers excellent image quality - slightly better than its various kit lenses are actually capable of rendering, it seems. In that regard, it's a great option for someone who wants to start with the kit and eventually add better glass.If you're looking for a DSLR and want something approachable yet serious, but not quite as pro as the D7100, the D5300 is an excellent option. It won't let anyone in this category down in terms of image or video quality. Absolute beginners can happily shoot away in Auto, and those who are a little more hands-on will find all of their basic exposure controls relatively easy to access. It's not the fine-tuned, semi-pro instrument that the D7100 is, but its image quality could lead you to believe otherwise.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Awesome gadget . Magnificent Image Quality., 2 August 2014"
            },
            {
               "body":"For last 5 years I've been learning photography using an advanced point and shoot camera Canon SX110 IS and since last 8 months had started to feel the need of upgrading to an D-SLR now. I read lots of reviews and tested different D-SLRs during this period. One thing came out certain was Nikon has far better D-SLRs than Canon in terms of image quality considering the cameras in the same price range.I finally arrived between selecting D7100 and D5300. I used D7100 for 10 days and clicked lots of images with it. Awesome performance no doubt. However, when using D5300, this camera too gave the exact same level of Image Quality of D7100 and awesome quality it is. For any person whose hobby is photography, I believe Image Quality is the most important point. Rest of things like LCD display, Wifi, GPS, etc... don't even count.Sure, D7100 gives you extra buttons so that you can configure your shot far more faster than on D5300, and few other features, but considering that D5300 is hell lot cheaper than D7100... makes one wonder. And also one needs to consider the cost of additional lenses in the future.So here are the advantages of D5300,1. Image quality that is at par with D71002. Video recording at 1080p / 60 fps (Great to have slow motion effect)2. Lesser weight and more portable (Guess because the removed the built in auto-focus motor)3. The Wifi helps to use your smartphone as a remote. This is great to take shots without shaking the cameraThere are no disadvantages as such, however, you need to know the limitations of this camera,1. There is no built in focus motor. So your lens needs to have the focusing motor built in. Not such a big problem, but one should be aware about this.2. Only one Function button and no additional buttons to change white balance, ISO, etc. So in D5300 you need to press the 'i' button and then use the menu d-pad and select the option to change these settings. Time consuming however with practice the time to change these values can be improved.3. You cannot change aperture in Live View. Now this is a little issue and hoping that Nikon fixes this through a camera firmware update.4. No weather sealing. One key advantage of D7100 is that it has weather protection. D5300 does not. So one needs to be extra carefulBottom line, if you earn money through your photography, then go buy the D7100 or D610 (a full frame sensor camera).If you just enjoy photography as a hobby and you save your hard-earned money like me to buy camera and lenses then buy the D5300, you will not be disappointed.If you have a lot of money, then go ahead and buy D7100 or even D610",
               "rating":5.0,
               "usefulness":0.92,
               "title":"Awesome Camera !!!!!!, 26 August 2014"
            },
            {
               "body":"The product is as good as advertised (of course my careful scrutiny of many reviews online helped)Wonderful camera, Used it for three weeks and quite worth it, I feel, especially along with the 18-140mm lens kit, which is much better than my previous kit where i had to shift back and forth between an 18-55mm and 55-200mm. The time spent changing lenses make me miss the shot, especially when travelling, where most environments are not ideal to detach the lens and expose the sensor.The built in wifi and the GPS drain the battery fast, if in use, so keep a close eye, or dont turn them on, especially GPS, unless you have a spare battery.Highly recommend if you can afford it.",
               "rating":5.0,
               "usefulness":0.9230769230769231,
               "title":"Excellent Product., 9 June 2014"
            },
            {
               "body":"After using more then four month I am in love with it and definitely you will also be.Features those were impressive and helpful in day to day photography.1. Vari-angle TFT Monitor : you need not be on your knees even for ground/ child shots.2. Absence of Low Pass Filter : resultant highly sharp images3. In built Wi-Fi : Control this camera with smart phone. Live view, focus and click images with mobile. Instant download to mobile directly from camera. No need to go back to your system to upload pics on social site. just click and upload.4. Best color capture in images5. It works best with Nikon AF-S 50mm prime lens. Best for portraits. (You can simply skip buying to kit lens i.e. Nikon 18-55mm cause once you work with prime lens you will never gonna use kit lens)6. 24 MP Sensor : Even after cropping images in ur system it gives superb results cause 24MP is more then we need. So once you capture a moment it help in retouch.",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Point to Point Review after 4 months use, 26 December 2014"
            },
            {
               "body":"It has been just a couple of days that I have purchased this DSLR camera from Amazon. Nikon has really excelled in its ergonomics of camera design (especially deep and good hand grip) by introducing Nikon D5300 in mid range level DSLR camera class. As a beginner to field of photography I was searching the best DSLR to start with good features and build quality which wouldn't burn a hole in my pocket. Initially I thought of going for D3300 but then after a bit research and taking opinions from friend (who is a photographer), I finally focused on Nikon D5300 and was impressed with so many features under its hood compared to that of Nikon D3300. Clearly this camera has pros such as 39 auto focus points, Wifi and Gps capability, Expeed 4 image processing chip used, video recording capability in 1080p 60fps and many more.... however I haven't faced any problems with it in order to write cons about it. But I must say I am very happy with my D5300 and hope to learn photography through iti am big fan of Nikon D5300.....",
               "rating":5.0,
               "usefulness":1.0,
               "title":"Nikon has really excelled in its ergonomics of camera design (especially deep and good hand grip) by introducing Nikon D5300 in, 21 November 2014"
            },
            {
               "body":"I Did a lot of review and research before buying this camera,One thing came out certain was Nikon has far better D-SLRs than Canon in terms of image quality considering the cameras in the same price range.Nikon D5300 is the best among its price range.With 24.2 MP The image Quality is undoubtedly Crisp and clearAdvantages- Stunning Image Quality- 39 Focus Points- 9 Image Effects already added- HD Video recording at 1080p / 60 fps- With the help of wifi you can click and save images directly to your smart phone and share it later with your convenience- Sturdy Grip- Flip out screen makes it easy to click at impossible anglesDisadvantages-The built in wifi and the GPS drains the battery fast- No weather sealing- The Bag came with it is not up to the mark ,low quality.You would have to buy a new bag for sureBottom line you will not be disappointed after buying this Nikon D5300",
               "rating":5.0,
               "usefulness":0.8333333333333334,
               "title":"Great Camera ...., 14 September 2014"
            },
            {
               "body":"Reached me before the delivery date in a healthy condition. I really loved the way the item was packed. I was looking for the camera for the past 6 months and was waiting for the good discount and it was Amazon discount offer which prompted me to buy the item.  I still have lot of learning to do with the camera, but i am enjoying it.",
               "rating":4.0,
               "usefulness":1.0,
               "title":"Great SLR Camera for beginners., 9 August 2014"
            },
            {
               "body":"Its a great product & needs a sharp precision & extreme well balanced judgement to choose this Black Beauty. This monster can, take pics at par wherein professional Flim Industry use high end DSLRs. Infact in some bollywood movies, D5300 is used recording the cinemas.Now regarding Amazon, I must say, delivery time is extremely good & much before than the expected time. The quality of material/ packaging & people involved in shipment/ dispatch was fabulous & very polite. In totality, I am very happy & satisfied with dealings through Amazon. Since I am a regular purchaser from Amazon, so the shipment quality/ people involved in deliveries, can be treated as a gross feedback from my end. However, this in turn presets a very high expectations from Amazon, so benchmarking would be tough going forward.... !!!!!!",
               "rating":5.0,
               "usefulness":null,
               "title":"Great Product with Wonderful Services from Amazon, 17 January 2015"
            },
            {
               "body":"I was jus lookin for d best deal...I did a lot of research and on this amazon dis nikon d5300 wid kit lens was priced around 46k and the same camera wid only body was priced around 45 k.....dis thing created a doubt and confusion and I fell into a dilemma dat I wud get d genuine product or not...but I had to keep trust in amazon and their 10day replacement guarentee thing showed me a positive sign...so I finally decided to place d order and asked for d one day delivery...and for my surprise I got it in less than 24 hrs....very great packaging and service from amazon...and the product nikon d 5300 is a decent amateur camera...wid very good performance...light weighted...good quality images...totally a superb first dslr to have...thanks amazon...!!",
               "rating":5.0,
               "usefulness":null,
               "title":"Best deal and a best first dslr to have..!!, 18 May 2014"
            },
            {
               "body":"Excellent product, the issue is only with the warranty, as amazon is not a authorised dealer of nikon, hence you need to go to a service centre to know weather the product and it's accessories are original and get a valid warranty.",
               "rating":4.0,
               "usefulness":1.0,
               "title":"nikon doesnt help on warranty, 17 November 2014"
            }
         ],
         "avg_rating":4.6
      },
      "specs":{
         "Item model number":"D5300Black",
         "Optical Zoom":"3 X",
         "img":"http://ecx.images-amazon.com/images/I/518-0DePAlL._SY300_.jpg",
         "ASIN":"B00JM4VE0A",
         "Screen Size":"3.2 Inches",
         "Brand":"Nikon",
         "Date First Available":"11 April 2014",
         "Optical Sensor Resolution":"24.1 Megapixels",
         "Item Weight":"2.1 Kg",
         "Model":"D5300Black",
         "price":46878.0,
         "Resolution":"24.1 megapixels",
         "Product Dimensions":"33.4 x 22 x 20 cm",
         "Included Components":"Nikon D5300 Digital SLR Body with 18-55mm VR Kit Lens, BS-1 Accessory Shoe Cover, DK-25 Rubber Eyecup, BF-1B Body Cap, EN-EL14a Rechargeable Li-ion Battery (with terminal cover), MH-24 Battery Charger, AN-DC3 Strap, UC-E17 USB Cable, EG-CP16 Audio/Video Cable, DK-5 Eyepiece Cap, ViewNX 2 CD, Reference CD (contains the Reference Manual), 8GB Card and Camera Bag."
      }
   },
   "d300s":{
      "url":"http://www.amazon.in/Nikon-D300S-12-3MP-Camera-Black/dp/B002JCSV6M",
      "reviews":{
         "reviews":[

         ],
         "avg_rating":4.0
      },
      "specs":{
         "Item model number":"25464",
         "Batteries:":"1 Lithium ion batteries required. (included)",
         "Max Vertical Resolution":"2848 Pixels",
         "Memory Storage Capacity":"1 GB",
         "Date First Available":"16 October 2012",
         "Has Self Timer":"Yes",
         "Has Image Stabilization":"No",
         "ASIN":"B002JCSV6M",
         "Product Dimensions":"14.7 x 7.4 x 11.4 cm",
         "img":"http://ecx.images-amazon.com/images/I/512SIid8XkL._SY300_.jpg",
         "Brand":"Nikon",
         "Battery Cell Composition":"Lithium Ion",
         "Max Resolution":"12.3",
         "Additional Features":"12.3 Megapixels, 3\" LCD, Full HD Recording, CMOS Image Sensor, 2 years Nikon India warranty",
         "Screen Size":"3 Inches",
         "Viewfinder Type":"OLED",
         "Included Components":"Nikon D300S Digital SLR Body, Rechargeable Li-ion Battery EN-EL3e, Quick Charger MH-18a, USB Cable UC-E4, Video Cable EG-D2, Strap AN-DC4, LCD monitor cover BM-8, Body cap, Eyepiece Cap DK-5, Rubber Eyecup DK-23, Software Suite CD-ROM, Power Cable",
         "Batteries Included":"Yes",
         "Batteries Required":"Yes",
         "price":84863.0,
         "Supported Image Type":"RAW, JPEG",
         "Optical Sensor Resolution":"12.3 Megapixels",
         "Item Weight":"853 g",
         "Includes AC Adapter":"Yes",
         "Continuous Shooting Speed":"7",
         "Model":"25464",
         "Min Focal Length":"27 Millimeters",
         "Display Type":"LCD",
         "Hardware Interface":"AV",
         "Max Shutter Speed":"1/8000 Seconds",
         "Min Shutter Speed":"30 seconds",
         "Includes External Memory":"Yes",
         "Digital Zoom":"100 X",
         "Display Technology":"LCD"
      }
   }
}
